Repository: sunfounder/vincent-kit
Catalog: docs/source/locale/*/LC_MESSAGES/1.11_interval.po
Languages: de

source: 1.11 Interval
de: 1.11 Intervall

source: Overview
de: Überblick

source: Sometimes you need to do two things at once. For example you might want to blink an LED while reading a button press. In this case, you can't use delay(), because Arduino pauses your program during the delay(). If the button is pressed while Arduino is paused waiting for the delay() to pass, your program will miss the button press.
de: Manchmal müssen Sie zwei Dinge gleichzeitig tun. Beispielsweise möchten Sie möglicherweise eine LED blinken lassen, während Sie einen Tastendruck lesen. In diesem Fall können Sie Verzögerung () nicht verwenden, da Arduino Ihr Programm während der Verzögerung () anhält. Wenn die Taste gedrückt wird, während Arduino angehalten ist und auf die Verzögerung () wartet, wird Ihr Programm den Tastendruck verpassen.

source: This sketch demonstrates how to blink an LED without using delay(). It turns the LED on and then makes note of the time. Then, each time through loop(), it checks to see if the desired blink time has passed. If it has, it toggles the LED on or off and makes note of the new time. In this way the LED blinks continuously while the sketch execution never lags on a single instruction.
de: Diese Skizze zeigt, wie Sie eine LED ohne Verzögerung blinken lassen (). Es schaltet die LED ein und notiert dann die Uhrzeit. Anschließend wird jedes Mal durch loop () überprüft, ob die gewünschte Blinkzeit abgelaufen ist. Wenn dies der Fall ist, wird die LED ein- oder ausgeschaltet und die neue Uhrzeit notiert. Auf diese Weise blinkt die LED kontinuierlich, während die Skizzenausführung niemals bei einer einzelnen Anweisung zurückbleibt.

source: An analogy would be warming up a pizza in your microwave, and also waiting some important email. You put the pizza in the microwave and set it for 10 minutes. The analogy to using delay() would be to sit in front of the microwave watching the timer count down from 10 minutes until the timer reaches zero. If the important email arrives during this time you will miss it.
de: Eine Analogie wäre, eine Pizza in Ihrer Mikrowelle aufzuwärmen und auch auf eine wichtige E-Mail zu warten. Sie stellen die Pizza in die Mikrowelle und stellen sie für 10 Minuten ein. Die Analogie zur Verwendung von Verzögerung () besteht darin, vor der Mikrowelle zu sitzen und zu beobachten, wie der Timer von 10 Minuten bis zum Nullpunkt herunterzählt. Wenn die wichtige E-Mail während dieser Zeit eintrifft, werden Sie sie vermissen.

source: What you would do in real life would be to turn on the pizza, and then check your email, and then maybe do something else (that doesn't take too long!) and every so often you will come back to the microwave to see if the timer has reached zero, indicating that your pizza is done.
de: Im wirklichen Leben brauchen Sie nur die Pizza einschalten, Ihre E-Mails abrufen und dann andere Dinge tun (es wird nicht zu lange dauern!), Und ab und zu gehen Sie zurück in die Mikrowelle, um sie auszuchecken Wenn der Timer Null erreicht hat, ist Ihre Pizza fertig.

source: Components Required
de: Erforderliche Komponenten

source: Refer to Part 2 to check details of hardware.
de: Informationen zur Hardware finden Sie in Teil 2.

source: In this example, we use digital pin 9 to drive the LED, and we attach one side of the resistor to the corresponding digital pins. The longer pin of LED (a positive electrode, referred to as anode) is connected to the other side of the resistor. The shorter pin (a negative electrode, referred to as cathode) of LED is attached to GND.
de: In diesem Beispiel verwenden wir den digitalen Pin 9, um die LED anzusteuern, und befestigen eine Seite des Widerstands an den entsprechenden digitalen Pins. Der längere LED-Pin (eine positive Elektrode, die als Anode bezeichnet wird) ist mit der anderen Seite des Widerstands verbunden. Der kürzere Stift (eine negative Elektrode, als Kathode bezeichnet) der LED ist an GND angeschlossen.

source: Schematic Diagram
de: Schematische Darstellung

source: When you finish uploading the codes to the Mega2560 board, you can see the LED uploading.
de: Wenn Sie mit dem Hochladen der Codes auf die Mega2560-Karte fertig sind, sehen Sie das Hochladen der LED.

source: Code Analysis
de: Code-Analyse

source: Declare the digital pin 9 as ledPin.
de: Deklarieren Sie den digitalen Pin 9 als LEDPin.

source: Set the state of ledState to LOW to turn off the LED.
de: Setzen Sie den Status von ledState auf LOW, um die LED auszuschalten.

source: Initial a variable named previousMillis to store previous operating time of microcontroller.
de: Initialisieren Sie eine Variable mit dem Namen previousMillis, um die vorherige Betriebszeit des Mikrocontrollers zu speichern.

source: Set the interval time to 1000ms (milliseconds).
de: Stellen Sie die Intervallzeit auf 1000 ms (Millisekunden) ein.

source: Set ledPin to OUTPUT mode.
de: Stellen Sie ledPin auf den OUTPUT-Modus.

source: In loop(), declare currentMillis to store the current time.
de: Deklarieren Sie in loop () currentMillis, um die aktuelle Zeit zu speichern.

source: When the interval between the current operating time and last updating time is larger than 1000ms, certain functions are triggered. Meanwhile, update the previousMillis to the current time for the next triggering that is to happen 1 second latter.
de: Wenn das Intervall zwischen der aktuellen Betriebszeit und der letzten Aktualisierungszeit größer als 1000 ms ist, werden bestimmte Funktionen ausgelöst. Aktualisieren Sie in der Zwischenzeit die vorherige Millis auf die aktuelle Zeit für die nächste Auslösung, die 1 Sekunde später erfolgen soll.

source: Here, certain functions executed at intervals are to change the state of LED.
de: Hier sollen bestimmte in Intervallen ausgeführte Funktionen den Zustand der LED ändern.

source: Phenomenon Picture
de: Phänomen Bild
