Repository: sunfounder/vincent-kit
Catalog: docs/source/locale/*/LC_MESSAGES/1.1_arduino_ide.po
Languages: de

source: Description
de: Beschreibung

source: Arduino is an open source platform with simple software and hardware. You can pick it up in short time even if you are a beginner. It provides an integrated development environment (IDE) for code compiling, compatible with multiple control boards. So you can just download the Arduino IDE, upload the sketches (i.e. the code files) to the board, and then you can see relative experimental phenomena. For more information, refer to http://www.arduino.cc.
de: Arduino ist eine Open Source-Plattform mit einfacher Software und Hardware. Auch Anfänger können es in kurzer Zeit meistern. Es bietet eine integrierte Entwicklungsumgebung (IDE) für die Codekompilierung und ist mit mehreren Steuerkarten kompatibel. Daher können Sie die Arduino-IDE herunterladen, die Skizze (dh die Codedatei) auf das Entwicklungsboard einladen und dann verwandte experimentelle Phänomene anzeigen. Weitere Informationen finden Sie unter http://www.arduino.cc.

source: Install Arduino IDE
de: Installieren Sie die Arduino IDE

source: Here are the installation steps on the windows system.
de: Hier sind die Installationsschritte auf dem Windows-System.

source: For other systems, please refer to: **Install Arduinio IDE in different and FAQ.pdf**
de: Weitere Systeme finden Sie unter: **Install Arduinio IDE in different and FAQ.pdf**

source: `Install Arduinio IDE in different and FAQ.pdf <https://github.com/sunfounder/sunfounder_vincent_kit_for_arduino/blob/master/docs/(EN)%20Install%20Arduino%20IDE%20in%20different%20and%20FAQ.pdf>`_
de: `Weitere Systeme finden Sie unter: Installieren Sie Arduinio IDE in different und FAQ.pdf<https://github.com/sunfounder/sunfounder_vincent_kit_for_arduino/blob/master/docs/(EN)%20Install%20Arduino%20IDE%20in%20different%20and%20FAQ.pdf>`_

source: The code in this kit is written based on Arduino, so you need to install the IDE first. Skip it if you have done this. Now go to `arduino.cc <http://www.arduino.cc>`__ and click SOFTWARE -> DOWNLOADs. On the page, check the software list on the right side.
de: Der Code in diesem Kit basiert auf Arduino, daher müssen Sie zuerst IDE installieren. überspringen Sie es, wenn Sie dies getan haben. Gehen Sie nun zu `arduino.cc <http://www.arduino.cc>`__ und klicken Sie auf SOFTWARE -> DOWNLOADs. überprüfen Sie auf der Seite die Softwareliste auf der rechten Seite.

source: Find the one that suits your operation system and click to download. There are two versions of Arduino for Windows: Installer or ZIP file. You're recommended to download the former.
de: Suchen Sie das passende Betriebssystem für Ihr Betriebssystem und klicken Sie auf Herunterladen Es gibt zwei Versionen von Arduino für Windows: Installer oder ZIP-Datei. Es wird empfohlen, die erstere herunterzuladen.

source: For Installer File
de: Für die Installationsdatei

source: **Step 1**: Find the .exe file just downloaded.
de: **Schritt 1:** Suchen Sie die exe-Datei gerade heruntergeladene.

source: **Step 2:** Double click the file and a window will pop up as below. Click **I Agree**.
de: **Schritt 2:** Doppelklicken Sie auf die Datei und ein Fenster wird wie folgt geöffnet. Klicken Sie auf Ich stimme zu.

source: **Step 3:** Click **Next.**
de: **Schritt 3:** Klicken Sie auf Weiter.

source: **Step 4**: Select the path to install. By default, it's set in the C disk. You can click **Browse** and choose other paths. Click **OK**. Then click Install.
de: **Schritt 4:** Wählen Sie den zu installierenden Pfad aus. Standardmäßig ist es auf der C-Disk festgelegt. Sie können auf Durchsuchen klicken und andere Pfade auswählen. Klicken Sie OK. Klicken Sie dann auf Installieren.

source: **Step 5:** Meanwhile, it will prompts install the needed drivers, please select the ‘Always trust software from “Arduino LLC” ’. After the installation is done, click **Close**.
de: **Schritt 5:** Gleichzeitig werden Sie aufgefordert, die erforderlichen Treiber zu installieren. Wählen Sie "Immer vertrauenswürdige Software von" Arduino LLC ". Klicken Sie nach Abschluss der Installation auf **Schließen**.

source: The new IDE may prompt errors when you're compiling code under Windows XP. So if your computer is running on XP, you're suggested to install Arduino 1.0.5 or 1.0.6. Also you can upgrade your computer.
de: Die neue IDE kann zu Fehlern führen, wenn Sie Code unter Windows XP kompilieren. Wenn Ihr Computer unter XP ausgeführt wird, wird empfohlen, Arduino 1.0.5 oder 1.0.6 zu installieren. Sie können auch Ihren Computer aktualisieren.

source: For ZIP File
de: Für ZIP-Datei

source: If you download the zip file before, when you connect the MCU to the computer, it may not be recognized. Then you need to install the driver manually. Take the following steps.
de: Wenn Sie die Zip-Datei bereits heruntergeladen haben, wird sie möglicherweise nicht erkannt, wenn Sie die MCU an den Computer anschließen. Dann müssen Sie den Treiber manuell installieren. Führen Sie die folgenden Schritte aus.

source: **Step 1**: Plug in the board to the computer with a 5V USB cable. After a while, a prompt message of failed installation will appear.
de: **Schritt 1:** Schließen Sie die Karte mit einem 5-V-USB-Kabel an den Computer an. Nach einer Weile wird eine Meldung angezeigt, dass die Installation fehlgeschlagen ist.

source: **Step 2**: Go to the Device Manager. You will find under other devices, Arduino Mega 2560 with an exclamation mark appear, which means the computer did not recognize the board.
de: **Schritt 2:** Gehen Sie zum Geräte-Manager. Unter anderen Geräten wird Arduino Mega 2560 mit einem Ausrufezeichen angezeigt, was bedeutet, dass der Computer die Karte nicht erkannt hat.

source: **Step 3**: Right click on **Arduino Mega 2560** and select **Update Driver Software**.
de: **Schritt 3:** Klicken Sie mit der rechten Maustaste auf **Arduino Mega 2560** und wählen Sie **Treibersoftware aktualisieren**.

source: **Step 4:** Choose the second option, **Browse my computer for Driver software**.
de: **Schritt 4:** Wählen Sie die zweite Option: **Durchsuchen Sie meinen Computer für Treibersoftware**.

source: **Step 5:** A window pops up then. Click **Browse**. Then go to the folder where you just extracted the file. Go to the *drivers* folder and click **OK** -> **Next**.
de: **Schritt 5:** Dann öffnet sich ein Fenster. Klicken Sie auf **Durchsuchen**. Gehen Sie dann zu dem Ordner, in den Sie gerade die Datei extrahiert haben. Gehen Sie zum **Treiberordner** und klicken Sie auf **OK** -> **Weiter**.

source: **Step 6:** Select ‘Always trust software from “Arduino LLC” ‘ then click Install.
de: **Schritt 6:** Wählen Sie ‘Always trust software from “Arduino LLC” ‘und klicken Sie auf Installieren.

source: It may need a sec. Then the system prompts you the driver has been installed successfully. So the computer can recognize the board now. Click **Close**.
de: Es kann eine Sekunde dauern. Anschließend werden Sie vom System aufgefordert, den Treiber erfolgreich zu installieren. So kann der Computer die Karte jetzt erkennen. Klicken Sie auf **Schließen**.

source: Open the Arduino Software (IDE)
de: Öffnen Sie die Arduino Software (IDE)

source: Double-click the Arduino icon (arduino.exe) created by the installation process.
de: Doppelklicken Sie auf das Arduino-Symbol (arduino.exe), das durch den Installationsprozess erstellt wurde.

source: Then the Arduino IDE will appear. Let's check details of the software.
de: Dann erscheint die Arduino IDE. Die Details der Software überprüfen.

source: 1. **Verify**: Compile your code. Any syntax problem will be prompted with errors.
de: 1. **Überprüfen**: Kompilieren Sie Ihren Code. Jedes Syntaxproblem wird mit Fehlern angezeigt.

source: 2. **Upload**: Upload the code to your board. When you click the button, the RX and TX LEDs on the board will flicker fast and won't stop until the upload is done.
de: 2. **Hochladen**: Laden Sie den Code auf Ihr Board hoch. Wenn Sie auf diese Schaltfläche klicken, blinken die RX- und TX-LEDs auf der Entwicklungsplatine schnell und hören erst auf, wenn der Upload abgeschlossen ist.

source: **New**: Create a new code editing window.
de: **Neu**: Erstellen Sie ein neues Codebearbeitungsfenster.

source: **Open**: Open an .ino sketch.
de: **Öffnen**: Öffnen Sie eine .ino-Skizze.

source: **Save**: Save the sketch.
de: **Speichern**: Speichern Sie die Skizze.

source: 6. **Serial Monitor**: Click the button and a window will appear. It receives the data sent from your control board. It is very useful for debugging.
de: 6. **Serieller Monitor**: Klicken Sie auf die Schaltfläche und ein Fenster wird angezeigt. Es empfängt die von Ihrer Steuerkarte gesendeten Daten. Es ist sehr nützlich zum Debuggen.

source: 7. **File**: Click the menu and a drop-down list will appear, including file creating, opening, saving, closing, some parameter configuring, etc.
de: 7. **Datei**: Klicken Sie auf das Menü und eine Dropdown-Liste wird angezeigt, einschließlich Erstellen, Öffnen, Speichern, Schließen, Konfigurieren einiger Parameter usw.

source: 8. **Edit**: Click the menu. On the drop-down list, there are some editing operations like Cut, Copy, Paste, Find, and so on, with their corresponding shortcuts.
de: 8. **Bearbeiten**: Klicken Sie auf das Menü. In der Dropdown-Liste befinden sich einige Bearbeitungsvorgänge wie Ausschneiden, Kopieren, Einfügen, Suchen usw. mit den entsprechenden Verknüpfungen.

source: 9. **Sketch**: Includes operations like Verify, Upload, Add files, etc. More important function is Include Library – where you can add libraries.
de: 9. **Skizze**: Enthält Vorgänge wie Überprüfen, Hochladen, Hinzufügen von Dateien usw. Weitere wichtige Funktionen sind Bibliotheken. Sie können ihnen Bibliotheken hinzufügen.

source: 10. **Tool**: Includes some tools – the most frequently used Board (the board you use) and Port (the port your board is at). Every time you want to upload the code, you need to select or check them.
de: 10. **Tools**: including some tools-the most commonly used motherboard (the Karte you use) and ports (the port where your motherboard is located). Jedes Mal, wenn Sie den Code hochladen möchten, müssen Sie ihn auswählen oder überprüfen.

source: 11. **Help**: If you're a beginner, you may check the options under the menu and get the help you need, including operations in IDE, introduction information, troubleshooting, code explanation, etc.
de: 11. **Hilfe**: Wenn Sie ein Anfänger sind, können Sie die Optionen im Menü überprüfen und die Hilfe erhalten, die Sie benötigen, einschließlich Vorgängen in der IDE, Einführungsinformationen, Fehlerbehebung, Code-Erklärung usw.

source: 12. In this message area, no matter when you compile or upload, the summary message will always appear.
de: 12. In diesem Nachrichtenbereich wird unabhängig vom Kompilieren oder Hochladen immer die Zusammenfassungsnachricht angezeigt.

source: 13. Detailed messages during compile and upload. For example, the file used lies in which path, the details of error prompts.
de: 13. Detaillierte Nachrichten beim Kompilieren und Hochladen. Zum Beispiel liegt die verwendete Datei in welchem Pfad, die Details der Fehleraufforderungen.

source: 14. **Board and Port**: Here you can preview the board and port selected for code upload. You can select them again by **Tools** -> **Board** / **Port** if any is incorrect.
de: 14. **Karte und Port**: Hier können Sie eine Vorschau der Karte und des Ports anzeigen, die für den Code-Upload ausgewählt wurden. Sie können sie erneut über **Tools** -> **Karte / Port** auswählen, falls einer nicht korrekt ist.

source: The editing area of the IDE. You can write code here.
de: Der Bearbeitungsbereich der IDE. Hier können Sie Code schreiben.
