Repository: sunfounder/vincent-kit
Catalog: docs/source/locale/*/LC_MESSAGES/1.9_digital_input_pull-up.po
Languages: de

source: 1.9 Digital Input Pull-Up
de: 1.9 Pull-up für Digitaleingänge

source: Overview
de: Überblick

source: When using some switch input devices, some pull-up or pull-down resistors are often used to keep the level of corresponding pins at certain value on the condition that the device is not working. Such as in 1.4 Digital Read, a 10k resistor is used to make the pin be connected to GND under the condition that the button is not pressed down. If we have used a lot of switch input components and want to simplify the circuit, we can set the pin mode to「INPUT_PULLUP」in the code so that the pin reads the high level in the suspended state.
de: Bei Verwendung einiger Schaltereingabegeräte werden häufig einige Pull-Up- oder Pull-Down-Widerstände verwendet, um den Pegel der entsprechenden Pins auf einem bestimmten Wert zu halten, sofern das Gerät nicht funktioniert. Wie bei 1.4 Digital Read wird ein 10k-Widerstand verwendet, um den Pin mit GND zu verbinden, unter der Bedingung, dass die Taste nicht gedrückt wird. Wenn wir viele Schaltereingangskomponenten verwendet haben und die Schaltung vereinfachen möchten, können wir den Pin-Modus im Code auf 「INPUT_PULLUP set setzen, damit der Pin den hohen Pegel im angehaltenen Zustand liest.

source: Components Required
de: Erforderliche Komponenten

source: In this example, we use pin 2 to read the signal of button. The internal pull-up in pin 2 is valid, so if the button isn’t pressed, HIGH is read in pin 2; when the button is pressed, LOW is read.
de: In diesem Beispiel verwenden wir Pin 2, um das Signal der Taste zu lesen. Das interne Pull-up in Pin 2 ist gültig. Wenn die Taste nicht gedrückt wird, wird in Pin 2 HIGH gelesen. Wenn die Taste gedrückt wird, wird LOW gelesen.

source: Schematic Diagram
de: Schematische Darstellung

source: After the codes are uploaded to the Mega2560 board, you can open the serial port monitor to view the read values of the pin. When the Button is pressed, the serial port monitor will display "0", and the "1" will be displayed when the button is released.
de: Nachdem die Codes auf die Mega2560-Karte hochgeladen wurden, können Sie den Monitor für die serielle Schnittstelle öffnen, um die Lesewerte des Pins anzuzeigen. Wenn die Taste gedrückt wird, zeigt der Monitor für die serielle Schnittstelle "0" und die "1" an, wenn die Taste losgelassen wird.

source: Code Analysis
de: Code-Analyse

source: Run the serial communication in setup() and set the data rate to 9600.
de: Führen Sie die serielle Kommunikation in setup () aus und stellen Sie die Datenrate auf 9600 ein.

source: Configure pin 2 as an input and enable the internal pull-up resistor.
de: Konfigurieren Sie Pin 2 als Eingang und aktivieren Sie den internen Pull-up-Widerstand.

source: Read the level state from the digital pin 2 by using digitalRead() statement in loop() and declare a variable to store it.
de: Lesen Sie den Pegelstatus vom digitalen Pin 2 mithilfe der Anweisung digitalRead () in loop () und deklarieren Sie eine Variable zum Speichern.

source: Print the values stored by variables on the serial port monitor.
de: Drucken Sie die von Variablen gespeicherten Werte auf dem Monitor der seriellen Schnittstelle.

source: Phenomenon Picture
de: Phänomen Bild
