Repository: sunfounder/vincent-kit
Catalog: docs/source/locale/*/LC_MESSAGES/2.12_servo.po
Languages: de

source: Overview
de: Überblick

source: In this lesson, you will learn something about Servo. Servo is a kind of driver whose position (angular) can be adjustable and kept or a rotary actuator that allows for precise control of angular position. Currently, it is widely used in upscale remote control toys, such as airplane, submarine, telerobot and so on.
de: In this course, you will learn about servo. Servo is a drive whose position (angle) can be adjusted and maintained, or a rotary actuator that can precisely control the angular position. Derzeit wird es häufig in hochwertigen ferngesteuerten Spielzeugen wie Flugzeugen, U-Booten, Telerobotern usw. verwendet.

source: Components Required
de: Erforderliche Komponenten

source: Component Introduction
de: Komponenteneinführung

source: A servo is generally composed of the following parts: case, shaft, gear system, potentiometer, DC motor, and embedded board.
de: Ein Servo besteht im Allgemeinen aus folgenden Teilen: Gehäuse, Welle, Getriebe, Potentiometer, Gleichstrommotor und eingebettete Platine.

source: It works like this: The microcontroller sends out PWM signals to the servo, and then the embedded board in the servo receives the signals through the signal pin and controls the motor inside to turn. As a result, the motor drives the gear system and then motivates the shaft after deceleration. The shaft and potentiometer of the servo are connected together. When the shaft rotates, it drives the potentiometer, so the potentiometer outputs a voltage signal to the embedded board. Then the board determines the direction and speed of rotation based on the current position, so it can stop exactly at the right position as defined and hold there.
de: Das funktioniert so: Der Mikrocontroller sendet das PWM-Signal an den Server, und dann empfängt die im Server eingebettete Karte das Signal über den Signalstift und steuert die Drehung des internen Motors. Infolgedessen treibt der Motor das Getriebesystem an und motiviert dann die Welle nach dem Abbremsen. Die Welle und das Potentiometer des Servos sind miteinander verbunden. Wenn sich die Welle dreht, treibt sie das Potentiometer an, sodass das Potentiometer ein Spannungssignal an die eingebettete Platine ausgibt. Dann bestimmt das Board die Drehrichtung und -geschwindigkeit basierend auf der aktuellen Position, sodass es genau an der richtigen Position wie definiert anhalten und dort halten kann.

source: The angle is determined by the duration of a pulse that is applied to the control wire. This is called Pulse width Modulation. The servo expects to see a pulse every 20 ms. The length of the pulse will determine how far the motor turns. For example, a 1.5ms pulse will make the motor turn to the 90 degree position (neutral position).
de: Der Winkel wird durch die Dauer eines Impulses bestimmt, der an den Steuerdraht angelegt wird. Dies wird als Pulsweitenmodulation bezeichnet. Das Servo erwartet alle 20 ms einen Impuls. Die Länge des Impulses bestimmt, wie weit sich der Motor dreht. Zum Beispiel bringt ein Impuls von 1.5 ms den Motor in die 90-Grad-Position (neutrale Position).

source: When a pulse is sent to a servo that is less than 1.5 ms, the servo rotates to a position and holds its output shaft some number of degrees counterclockwise from the neutral point.
de: Wenn der an das Servo gesendete Impuls weniger als 1.5 ms beträgt, dreht sich das Servo in eine Position und hält seine Abtriebswelle in einem bestimmten Winkel gegen den Uhrzeigersinn vom Neutralpunkt.

source: When the pulse is wider than 1.5 ms the opposite occurs. The minimal width and the maximum width of pulse that will command the servo to turn to a valid position are functions of each servo. Generally the minimum pulse will be about 0.5 ms wide and the maximum pulse will be 2.5 ms wide.
de: Wenn der Impuls breiter als 1.5 ms ist, tritt das Gegenteil auf. Die minimale Breite und die maximale Impulsbreite, die das Servo anweisen, sich in eine gültige Position zu drehen, sind Funktionen jedes Servos. Im Allgemeinen ist der minimale Impuls ungefähr 0.5 ms breit und der maximale Impuls ist 2.5 ms breit.

source: In this example, we use PWM pin 9 to drive the Servo, and get the orange wire of the servo connected to the PWM pin 9, the red one to 5V, and the brown one to GND.
de: In diesem Beispiel verwenden wir den PWM-Pin 9, um den Servo anzusteuern, und verbinden den orangefarbenen Draht des Servos mit dem PWM-Pin 9, den roten mit 5 V und den braunen mit GND.

source: Schematic Diagram
de: Schematische Darstellung

source: Once you finish uploading the codes to the Mega2560 board, you can see the servo arm rotating in the range 0°~180°.
de: Sobald Sie die Codes auf die Mega2560-Karte hochgeladen haben, können Sie sehen, wie sich der Servoarm im Bereich von 0 ° bis 180 ° dreht.

source: Code Analysis
de: Code-Analyse

source: By calling the library Servo.h, you can drive the servo easily.
de: Durch Aufrufen der Bibliothek Servo.h können Sie das Servo problemlos fahren.

source: **Library Functions：**
de: **Bibliotheksfunktionen:**

source: Create **Servo** object to control a servo.
de: Erstellen Sie ein **Servo**-Objekt, um ein Servo zu steuern.

source: Turn a pin into a servo driver. Calls pinMode. Returns 0 on failure.
de: Verwandeln Sie einen Stift in einen Servotreiber. Ruft pinMode auf. Gibt bei einem Fehler 0 zurück.

source: Release a pin from servo driving.
de: Lösen Sie einen Stift vom Servoantrieb.

source: Set the angle of the servo in degrees, 0 to 180.
de: Stellen Sie den Winkel des Servos in Grad von 0 bis 180 ein.

source: Return that value set with the last write().
de: Gibt den mit dem letzten eingestellten Wert zurück.

source: Return 1 if the servo is currently attached.
de: Geben Sie 1 zurück, wenn das Servo gerade angeschlossen ist.

source: Phenomenon Picture
de: Phänomen Bild
