Repository: sunfounder/vincent-kit
Catalog: docs/source/locale/*/LC_MESSAGES/2.13_motor.po
Languages: de

source: Overview
de: Überblick

source: In this lesson, you will learn how to use Motor, the working principle of which is that the energized coil is forced to rotate in the magnetic field then the rotor of the motor rotates accordingly on which the pinion gear drives the engine flywheel to rotate.
de: In dieser Lektion lernen Sie den Umgang mit einem Elektromotor. Das Funktionsprinzip des Elektromotors besteht darin, die unter Spannung stehende Spule zu zwingen, sich in einem Magnetfeld zu drehen. Anschließend dreht sich der Rotor des Motors entsprechend und das Ritzel treibt das Schwungrad des Motors auf dem Rotor an.

source: Components Required
de: Erforderliche Komponenten

source: Component Introduction
de: Komponenteneinführung

source: This is a 5V DC motor. It will rotate when you give the two terminals of the copper sheet one high and one low level. For convenience, you can weld the pins to it.
de: Dies ist ein 5V Gleichstrommotor. Es dreht sich, wenn Sie den beiden Anschlüssen des Kupferblechs einen hohen und einen niedrigen Pegel geben. Der Einfachheit halber können Sie die Stifte daran schweißen.

source: L293D is a 4-channel motor driver integrated by chip with high voltage and high current. It's designed to connect to standard DTL, TTL logic level, and drive inductive loads (such as relay coils, DC, Stepper Motors) and power switching transistors etc. DC Motors are devices that turn DC electrical energy into mechanical energy. They are widely used in electrical drive for their superior speed regulation performance.
de: L293D ist ein 4-Kanal-Motortreiber, der durch einen Chip mit hoher Spannung und hohem Strom integriert ist. Es ist für den Anschluss an Standard-DTL-, TTL-Logikpegel und die Ansteuerung von induktiven Lasten (wie Relaisspulen, Gleichstrom-, Schrittmotoren) und Leistungsschalttransistoren usw. ausgelegt. Gleichstrommotoren sind Geräte, die elektrische Gleichstromenergie in mechanische Energie umwandeln. Sie sind im elektrischen Antrieb wegen ihrer überlegenen Geschwindigkeitsregelungsleistung weit verbreitet.

source: L293D has two pins (Vcc1 and Vcc2) for power supply. Vcc2 is used to supply power for the motor, while Vcc1 to supply for the chip.
de: Der L293D verfügt über zwei Pins (Vcc1 und Vcc2) für die Stromversorgung. Vcc2 dient zur Stromversorgung des Motors, Vcc1 zur Stromversorgung des Chips.

source: The following is the internal structure of L293D. Pin EN is an enable pin and only works with high level; A stands for input and Y for output. You can see the relationship among them at the right bottom. When pin EN is High level, if A is High, Y outputs high level; if A is Low, Y outputs Low level. When pin EN is Low level, the L293D does not work.
de: Das Folgende ist die interne Struktur von L293D. Pin EN ist ein Freigabepin und funktioniert nur mit hohem Pegel. A steht für Eingabe und Y für Ausgabe. Sie können die Beziehung zwischen ihnen unten rechts sehen. Wenn Pin EN High High ist, wenn A High ist, gibt Y High Pegel aus; Wenn A niedrig ist, gibt Y einen niedrigen Pegel aus. Wenn Pin EN auf Low-Pegel steht, funktioniert der L293D nicht.

source: Power Supply Module
de: Energieversorgungs Modul

source: In this experiment, it needs large currents to drive the motor especially when it starts and stops, which will severely interfere with the normal work of Raspberry Pi. Therefore, we separately supply power for the motor by this module to make it run safely and steadily.
de: In diesem Experiment ist ein großer Strom erforderlich, um den Motor anzutreiben, insbesondere wenn der Motor startet und stoppt, was den normalen Betrieb des Raspberry Pi ernsthaft beeinträchtigt. Aus diesem Grund versorgen wir diesen Motor separat mit Strom, damit er sicher und gleichmäßig läuft.

source: You can just plug it in the breadboard to supply power. It provides a voltage of 3.3V and 5V, and you can connect either via a jumper cap included.
de: Sie können es einfach an das Steckbrett anschließen, um Strom zu liefern. Es liefert eine Spannung von 3,3 V und 5 V, und Sie können entweder über eine mitgelieferte Überbrückungskappe anschließen.

source: In this example, we use Power Supply Module to power the anode and cathode of breadboard. GND of Mega 2560 Board is connected to the cathode.
de: In diesem Beispiel verwenden wir das Stromversorgungsmodul, um die Anode und Kathode des Steckbretts mit Strom zu versorgen. GND der Mega 2560-Platine ist mit der Kathode verbunden.

source: Schematic Diagram
de: Schematische Darstellung

source: After uploading the codes to the Mega2560 board, you can select the rotating direction of motor by typing 「A」 or 「B」 in the serial monitor.
de: Nach dem Hochladen der Codes auf die Mega2560-Karte können Sie die Drehrichtung des Motors auswählen, indem Sie im seriellen Monitor 「A」 oder 「B」 eingeben.

source: Code Analysis
de: Code-Analyse

source: The motor can be driven by providing a voltage difference between the copper sheets at both sides of the motor. Therefore, you only need to write 0 for the voltage of one side of the copper sheet and 5V for the other side. Modify the written analog signal value to adjust the direction and speed.
de: Der Motor kann angetrieben werden, indem eine Spannungsdifferenz zwischen den Kupferblechen auf beiden Seiten des Motors bereitgestellt wird. Daher müssen Sie nur 0 für die Spannung einer Seite des Kupferblechs und 5 V für die andere Seite schreiben. Ändern Sie den geschriebenen analogen Signalwert, um die Richtung und Geschwindigkeit anzupassen.

source: In this example, Serial.Read() is used to control the direction of motor.
de: In diesem Beispiel wird Serial.Read () verwendet, um die Richtung des Motors zu steuern.

source: When you type ’A’ in serial monitor, there calls the clockwise (255) function to make the motor rotate with the speed of 255. Input 'B', and the motor will rotate in reverse direction.
de: Wenn Sie im seriellen Monitor 'A' eingeben, wird die Funktion im Uhrzeigersinn (255) aufgerufen, um den Motor mit der Drehzahl 255 drehen zu lassen. Geben Sie 'B' ein und der Motor dreht sich in umgekehrter Richtung.

source: Phenomenon Picture
de: Phänomen Bild
