Repository: sunfounder/vincent-kit
Catalog: docs/source/locale/*/LC_MESSAGES/2.14_stepper_motor.po
Languages: de

source: 2.14 Stepper Motor
de: 2.14 Schrittmotor

source: Overview
de: Überblick

source: In this lesson, you will learn about Stepper Motor.
de: In dieser Lektion lernen Sie den Schrittmotor kennen.

source: Components Required
de: Erforderliche Komponenten

source: Component Introduction
de: Komponenteneinführung

source: Stepper motor is an open-loop control motor by converting the electric pulse signal into angular displacement or line displacement. It is the main executing component in the modern digital program control system. When the stepper driver receives a pulse signal, it drives the stepper motor to rotate a fixed angle in a set direction. The rotation of stepper driver runs step by step at a fixed angle. The angular displacement can be controlled by changing the number of pulses, thereby achieving the purpose of accurate positioning. At the same time, the speed and acceleration of the rotation of the motor can be controlled by adjusting the pulse frequency so as to achieve the purpose of speed regulation.
de: Der Schrittmotor ist ein Steuermotor mit offenem Regelkreis, der das elektrische Impulssignal in eine Winkelverschiebung oder eine Linienverschiebung umwandelt. Es ist die Hauptausführungskomponente im modernen digitalen Programmsteuersystem. Wenn der Schritttreiber ein Impulssignal empfängt, treibt er den Schrittmotor an, um einen festen Winkel in eine festgelegte Richtung zu drehen. Die Drehung des Schrittantriebs bewegt sich allmählich in einem festen Winkel. Die Winkelverschiebung kann durch Ändern der Anzahl der Impulse gesteuert werden, um eine präzise Positionierung zu erreichen. Gleichzeitig können Drehzahl und Beschleunigung des Motors durch Einstellen der Pulsfrequenz gesteuert werden, um den Zweck der Drehzahlregelung zu erreichen.

source: There are two types of steppers, unipolars and bipolars, and it is very important to know which type you are working with. In this experiment, we will use a unipolar stepper.
de: Es gibt zwei Arten von Steppern, Unipolare und Bipolare, und es ist sehr wichtig zu wissen, mit welchem Typ Sie arbeiten. In diesem Experiment verwenden wir einen unipolaren Stepper.

source: The stepper motor is a four-phase one, which uses a unipolarity DC power supply. As long as you electrify all phase windings of the motor by an appropriate timing sequence, you can make it rotate step by step. The schematic diagram of a four-phase reactive stepper motor:
de: Der Schrittmotor ist ein Vierphasenmotor, der eine Gleichstromversorgung mit Unipolarität verwendet. Solange Sie alle Phasenwicklungen des Motors durch eine geeignete Zeitfolge elektrifizieren, können Sie ihn Schritt für Schritt drehen lassen. Das schematische Diagramm eines vierphasigen reaktiven Schrittmotors:

source: In the figure, in the middle of the motor is a rotor – a gear-shaped permanent magnet. Around the rotor, 0 to 5 are teeth. Then more outside, there are 8 magnetic poles, with each two opposite ones connected by coil winding. So they form four pairs from A to D, which is called a phase. It has four lead wires to be connected with switches SA, SB, SC, and SD. Therefore, the four phases are in parallel in the circuit, and the two magnetic poles in one phase are in series.
de: In der Abbildung befindet sich in der Mitte des Motors ein Rotor - ein zahnradförmiger Permanentmagnet. Um den Rotor herum sind 0 bis 5 Zähne. Dann weiter draußen gibt es 8 Magnetpole, wobei jeweils zwei gegenüberliegende durch Spulenwicklung verbunden sind. Sie bilden also vier Paare von A nach D, was als Phase bezeichnet wird. Es verfügt über vier Anschlusskabel, die mit den Schaltern SA, SB, SC und SD verbunden werden können. Daher sind die vier Phasen in der Schaltung parallel und die zwei Magnetpole in einer Phase sind in Reihe geschaltet.

source: **Here's how a 4-phase stepper motor works:**
de: **So funktioniert ein 4-Phasen-Schrittmotor:**

source: When switch SB is power on, switch SA, SC, and SD is power off, and B-phase magnetic poles align with tooth 0 and 3 of the rotor. At the same time, tooth 1 and 4 generate staggered teeth with C- and D-phase poles. Tooth 2 and 5 generate staggered teeth with D- and A-phase poles. When switch SC is power on, switch SB, SA, and SD is power off, the rotor rotates under magnetic field of C-phase winding and that between tooth 1 and 4. Then tooth 1 and 4 align with the magnetic poles of C-phase winding. While tooth 0 and 3 generate staggered teeth with A- and B-phase poles, and tooth 2 and 5 generate staggered teeth with the magnetic poles of A- and D-phase poles. The similar situation goes on and on. Energize the A, B, C and D phases in turn, and the rotor will rotate in the order of A, B, C and D.
de: Wenn der Schalter SB eingeschaltet ist, sind die Schalter SA, SC und SD ausgeschaltet, und die B-Phasen-Magnetpole sind auf die Zähne 0 und 3 des Rotors ausgerichtet. Gleichzeitig erzeugen Zahn 1 und 4 versetzte Zähne mit C- und D-Phasenpolen. Zahn 2 und 5 erzeugen versetzte Zähne mit D- und A-Phasenpolen. Wenn der Schalter SC eingeschaltet ist, die Schalter SB, SA und SD ausgeschaltet sind, dreht sich der Rotor unter dem Magnetfeld der C-Phasenwicklung und dem zwischen Zahn 1 und 4. Dann richten sich Zahn 1 und 4 an den Magnetpolen der C-Phasenwicklung aus. Während Zahn 0 und 3 versetzte Zähne mit A- und B-Phasenpolen erzeugen, erzeugen Zahn 2 und 5 versetzte Zähne mit den Magnetpolen von A- und D-Phasenpolen. Die ähnliche Situation geht weiter und weiter. Schalten Sie die Phasen A, B, C und D nacheinander ein, und der Rotor dreht sich in der Reihenfolge A, B, C und D.

source: The stator of Stepper Motor we use has 32 magnetic poles, so a circle needs 32 steps. The output shaft of the Stepper Motor is connected with a reduction gear set, and the reduction ratio is 1/64. **So the final output shaft rotates a circle requiring a 32*64=2048 step**.
de: Der von uns verwendete Stator des Schrittmotors hat 32 Magnetpole, sodass ein Kreis 32 Schritte benötigt. Die Abtriebswelle des Schrittmotors ist mit einem Untersetzungsgetriebe verbunden, und das Untersetzungsverhältnis beträgt 1/64. **Daher erfordert die endgültige Abtriebswelle zum Drehen eines Kreises 32 * 64 = 2048 Schritte**.

source: Power Supply Module is used to power the stepper motor. Get the GND of Mega 2560 Board and GND of ULN2003 connected to the cathode of the breadboard, and connect the VCC of ULN2003 to 5V OUTPUT of Power Supply.
de: Das Stromversorgungsmodul dient zur Stromversorgung des Schrittmotors. Schließen Sie die GND der Mega 2560-Platine und die GND der ULN2003 an die Kathode des Steckbretts an und verbinden Sie die VCC der ULN2003 mit dem 5-V-AUSGANG der Stromversorgung.

source: The wiring of ULN2003 and Mega2560 is shown as follows:
de: Die Verkabelung von ULN2003 und Mega2560 ist wie folgt dargestellt:

source: Schematic Diagram
de: Schematische Darstellung

source: After uploading the codes to the Mega2560 board, you will be able to see that the stepper motor rotates one circle with an interval of a second and each circle takes 3.75s.
de: Nachdem Sie den Code auf die Mega2560-Karte hochgeladen haben, können Sie sehen, wie der Schrittmotor einen Kreis im Abstand von einer Sekunde dreht. Jeder Kreis benötigt 3,75 Sekunden.

source: Code Analysis
de: Code-Analyse

source: By calling the library Stepper.h, you can easily drive the stepper motor.
de: Durch Aufrufen der Bibliothek Stepper.h können Sie den Schrittmotor problemlos antreiben.

source: **Library Functions：**
de: **Bibliotheksfunktionen:**

source: Creates a new instance of the Stepper class that represents a particular stepper motor attached to your Arduino board.
de: Erstellt eine neue Instanz der Stepper-Klasse, die einen bestimmten Schrittmotor darstellt, der an Ihr Arduino-Board angeschlossen ist.

source: **steps**: the number of steps in one revolution of your motor. If your motor gives the number of degrees per step, divide that number into 360 to get the number of steps (e.g. 360 / 3.6 gives 100 steps). (int)
de: **Schritte**: Die Anzahl der Schritte in einer Umdrehung Ihres Motors. Wenn Ihr Motor die Anzahl der Grad pro Schritt angibt, teilen Sie diese Zahl in 360, um die Anzahl der Schritte zu erhalten (z. B. 360 / 3.6 ergibt 100 Schritte). (int)

source: Every circle of the stepper motor takes 2048 steps.
de: Jeder Kreis des Schrittmotors benötigt 2048 Schritte.

source: Sets the motor speed in rotations per minute. This function doesn't make the motor turn, just sets the speed at which it will when you call step().
de: Stellt die Motordrehzahl in Umdrehungen pro Minute ein. Diese Funktion lässt den Motor nicht drehen, sondern stellt nur die Geschwindigkeit ein, mit der er sich bewegt, wenn Sie step () aufrufen.

source: **rpm**: the speed at which the motor should turn in rotations per minute - a positive number. (long)
de: **U / min**: Die Geschwindigkeit, mit der sich der Motor in Umdrehungen pro Minute drehen soll - eine positive Zahl. (lange)

source: The stepper motor we use here rotates 17 circles a minute at most.
de: Der hier verwendete Schrittmotor dreht höchstens 17 Kreise pro Minute.

source: Turns the motor a specific number of steps, at a speed determined by the most recent call to setSpeed().
de: Dreht den Motor um eine bestimmte Anzahl von Schritten mit einer Geschwindigkeit, die durch den letzten Aufruf von setSpeed () bestimmt wurde.

source: **This function is blocking;** that is, it will wait until the motor has finished moving to pass control to the next line in your sketch. For example, if you set the speed to, say, 1 RPM and called step(2048) on a 2048-step motor, this function would take a full minute to run. For better control, keep the speed high and only go a few steps with each call to step().
de: **Diese Funktion blockiert**: Das heißt, es wird gewartet, bis sich der Motor vollständig bewegt hat, um die Steuerung an die nächste Zeile in Ihrer Skizze weiterzuleiten. Wenn beispielsweise die Drehzahl auf 1 U / min eingestellt ist und Schritt (2048) an einem 2048-Schrittmotor aufgerufen wird, dauert der Betrieb dieser Funktion eine volle Minute. Halten Sie zur besseren Kontrolle die Geschwindigkeit hoch und gehen Sie bei jedem Aufruf von step () nur ein paar Schritte.

source: **steps:** the number of steps to turn the motor - positive to turn one direction, negative to turn the other. (int)
de: **Schritte**: Die Anzahl der Schritte zum Drehen des Motors - positiv zum Drehen in eine Richtung, negativ zum Drehen der anderen. (int)

source: Phenomenon Picture
de: Phänomen Bild
