Repository: sunfounder/vincent-kit
Catalog: docs/source/locale/*/LC_MESSAGES/2.19_keypad.po
Languages: de

source: 2.19 Keypad
de: 2.19 Tastatur

source: **Overview**
de: **Überblick**

source: In this lesson, you will learn to use Keypad. Keypad can be applied into various kinds of devices, including mobile phone, fax machine, microwave oven and so on. It is commonly used in user input.
de: In dieser Lektion lernen Sie die Verwendung der Tastatur. Die Tastatur kann auf verschiedene Arten von Geräten angewendet werden, darunter Mobiltelefone, Faxgeräte, Mikrowellengeräte usw. Es wird häufig bei Benutzereingaben verwendet.

source: **Components Required**
de: **Erforderliche Komponenten**

source: **Component Introduction**
de: **Komponenteneinführung**

source: A keypad is a rectangular array of 12 or 16 OFF-(ON) buttons. Their contacts are accessed via a header suitable for connection with a ribbon cable or insertion into a printed circuit board. In some keypads, each button connects with a separate contact in the header, while all the buttons share a common ground.
de: Eine Tastatur ist eine rechteckige Anordnung von 12 oder 16 AUS- (EIN) Tasten. Der Zugriff auf ihre Kontakte erfolgt über einen Header, der zum Anschluss mit einem Flachbandkabel oder zum Einsetzen in eine Leiterplatte geeignet ist. Bei einigen Tastaturen ist jede Taste mit einem separaten Kontakt in der Kopfzeile verbunden, während alle Tasten eine gemeinsame Masse haben.

source: More often, the buttons are matrix encoded, meaning that each of them bridges a unique pair of conductors in a matrix. This configuration is suitable for polling by a microcontroller, which can be programmed to send an output pulse to each of the four horizontal wires in turn. During each pulse, it checks the remaining four vertical wires in sequence, to determine which one, if any, is carrying a signal. Pullup or pulldown resistors should be added to the input wires to prevent the inputs of the microcontroller from behaving unpredictably when no signal is present.
de: Häufiger sind die Tasten matrixcodiert, was bedeutet, dass jede von ihnen ein eindeutiges Leiterpaar in einer Matrix überbrückt. Diese Konfiguration eignet sich zum Abfragen durch einen Mikrocontroller, der so programmiert werden kann, dass er nacheinander Ausgangsimpulse an jede der vier horizontalen Drähte sendet. Während jedes Impulses werden die verbleibenden vier vertikalen Drähte nacheinander überprüft, um festzustellen, welcher, falls vorhanden, ein Signal führt. Pullup- oder Pulldown-Widerstände sollten zu den Eingangsleitungen hinzugefügt werden, um zu verhindern, dass sich die Eingänge des Mikrocontrollers unvorhersehbar verhalten, wenn kein Signal vorhanden ist.

source: In this example, we extend the pins 1~8 of Keypad to connect to the digital pins 2~9.
de: In diesem Beispiel erweitern wir die Pins 1 bis 8 der Tastatur, um sie mit den digitalen Pins 2 bis 9 zu verbinden.

source: **Schematic Diagram**
de: **Schematische Darstellung**

source: The codes use the `library Keypad.h <https://github.com/sunfounder/sunfounder_vincent_kit_for_arduino/tree/master/library>`_ Please refer to :ref:`4.1 Add Libraries` to import the library.
de: Die Codes verwenden die `Bibliothek Keypad.h <https://github.com/sunfounder/sunfounder_vincent_kit_for_arduino/tree/master/library>`_. Weitere Informationen zum Importieren der Bibliothek finden Sie in `Teil 4 - 4.1 Hinzufügen von Bibliotheken`.

source: After uploading the codes to the Mega2560 board, on the serial monitor, you can see the value of the key currently pressed on the Keypad.
de: Nach dem Hochladen der Codes auf die Mega2560-Karte können Sie auf dem seriellen Monitor den Wert der aktuell auf der Tastatur gedrückten Taste anzeigen.

source: **Code Analysis**
de: **Code-Analyse**

source: By calling the Keypad.h library, you can easily use Keypad.
de: Durch Aufrufen der Bibliothek Keypad.h können Sie Keypad problemlos verwenden.

source: **Library Functions：**
de: **Bibliotheksfunktionen:**

source: Initializes the internal keymap to be equal to userKeymap.
de: Initialisiert die interne Keymap so, dass sie der UserKeymap entspricht.

source: userKeymap: The symbols on the buttons of the keypads.
de: userKeymap: Die Symbole auf den Tasten der Tastaturen.

source: row, col: Pin configuration.
de: row, col: Pin-Konfiguration.

source: numRows, numCols: Keypad sizes.
de: numRows, numCols: Tastaturgrößen.

source: Returns the key that is pressed, if any. This function is non-blocking.
de: Gibt die gedrückte Taste zurück, falls vorhanden. Diese Funktion ist nicht blockierend.

source: **Phenomenon Picture**
de: **Phänomen Bild**
