Repository: sunfounder/vincent-kit
Catalog: docs/source/locale/*/LC_MESSAGES/2.21_relay_module.po
Languages: de

source: 2.21 Relay Module
de: 2.21 Relaismodul

source: **Overview**
de: **Überblick**

source: In this lesson, you will learn about Relay Module.
de: In dieser Lektion lernen Sie das Relaismodul kennen.

source: **Components Required**
de: **Erforderliche Komponenten**

source: **Component Introduction**
de: **Komponenteneinführung**

source: As we may know, relay is a device which is used to provide connection between two or more points or devices in response to the input signal applied. In other words, relays provide isolation between the controller and the device as devices may work on AC as well as on DC. However, they receive signals from a microcontroller which works on DC hence requiring a relay to bridge the gap. Relay is extremely useful when you need to control a large amount of current or voltage with small electrical signal.
de: Wie wir vielleicht wissen, ist Relais ein Gerät, das verwendet wird, um eine Verbindung zwischen zwei oder mehr Punkten oder Geräten als Reaktion auf das angelegte Eingangssignal herzustellen. Mit anderen Worten, Relais stellen eine Isolation zwischen der Steuerung und dem Gerät bereit, da Geräte sowohl mit Wechselstrom als auch mit Gleichstrom arbeiten können. Sie empfangen jedoch Signale von einem Mikrocontroller, der mit Gleichstrom arbeitet, weshalb ein Relais erforderlich ist, um die Lücke zu schließen. Das Relais ist äußerst nützlich, wenn Sie eine große Menge an Strom oder Spannung mit einem kleinen elektrischen Signal steuern müssen.

source: There are 5 parts in every relay:
de: Jedes Relais besteht aus 5 Teilen:

source: 1. **Electromagnet** – It consists of an iron core wounded by coil of wires. When electricity is passed through, it becomes magnetic. Therefore, it is called electromagnet.
de: 1. **Elektromagnet** - Er besteht aus einem Eisenkern, der durch eine Drahtspule gewickelt ist. Wenn Elektrizität durchgelassen wird, wird sie magnetisch. Daher wird es Elektromagnet genannt.

source: 2. **Armature** – The movable magnetic strip is known as armature. When current flows through them, the coil is it energized thus producing a magnetic field which is used to make or break the normally open (N/O) or normally close (N/C) points. And the armature can be moved with direct current (DC) as well as alternating current (AC).
de: 2. **Anker** - Der bewegliche Magnetstreifen wird als Anker bezeichnet. Wenn Strom durch sie fließt, wird die Spule erregt, wodurch ein Magnetfeld erzeugt wird, das verwendet wird, um normalerweise offene (N / O) oder normalerweise geschlossene (N / C) Punkte zu bilden oder zu zerstören. Der Anker kann sowohl mit Gleichstrom (DC) als auch mit Wechselstrom (AC) bewegt werden.

source: 3. **Spring** – When no currents flow through the coil on the electromagnet, the spring pulls the armature away so the circuit cannot be completed.
de: 3. **Feder** - Wenn am Elektromagneten keine Ströme durch die Spule fließen, zieht die Feder den Anker weg, sodass der Stromkreis nicht abgeschlossen werden kann.

source: Set of electrical **contacts** – There are two contact points:
de: Satz elektrischer **Kontakte** - Es gibt zwei Kontaktpunkte:

source: Normally open - connected when the relay is activated, and disconnected when it is inactive.
de: Normalerweise offen - verbunden, wenn das Relais aktiviert ist, und getrennt, wenn es inaktiv ist.

source: Normally close – not connected when the relay is activated, and connected when it is inactive.
de: Normalerweise geschlossen - nicht angeschlossen, wenn das Relais aktiviert ist, und angeschlossen, wenn es inaktiv ist.

source: Molded frame – Relays are covered with plastic for protection.
de: Formrahmen - Die Relais sind zum Schutz mit Kunststoff bedeckt.

source: **Working of Relay**
de: **Funktionieren des Relais**

source: The working principle of relay is simple. When power is supplied to the relay, currents start flowing through the control coil; as a result, the electromagnet starts energizing. Then the armature is attracted to the coil, pulling down the moving contact together thus connecting with the normally open contacts. So the circuit with the load is energized. Then breaking the circuit would a similar case, as the moving contact will be pulled up to the normally closed contacts under the force of the spring. In this way, the switching on and off of the relay can control the state of a load circuit.
de: Das Funktionsprinzip des Relais ist einfach. Wenn das Relais mit Strom versorgt wird, fließen Ströme durch die Steuerspule. Infolgedessen beginnt der Elektromagnet zu erregen. Dann wird der Anker von der Spule angezogen, wobei der bewegliche Kontakt zusammengezogen wird, wodurch eine Verbindung mit den normalerweise offenen Kontakten hergestellt wird. Der Stromkreis mit der Last wird also erregt. Ein Unterbrechen des Stromkreises wäre dann ein ähnlicher Fall, da der bewegliche Kontakt unter der Kraft der Feder zu den normalerweise geschlossenen Kontakten hochgezogen wird. Auf diese Weise kann das Ein- und Ausschalten des Relais den Zustand eines Lastkreises steuern.

source: In this example, we use Power Supply Module to power the load，use LED as an example.
de: In diesem Beispiel verwenden wir das Netzteilmodul, um die Last mit Strom zu versorgen. Verwenden Sie als Beispiel die LED.

source: **Schematic Diagram**
de: **Schematische Darstellung**

source: Once the codes are uploaded to the Mega2560 board, you can see that the Relay Module controls the closing and breaking of the external circuit, which will change its working state a second. For detailed code explanation, refer to :ref:`1.2 Digital Write`.
de: Sobald die Codes auf die Mega2560-Karte hochgeladen wurden, können Sie sehen, dass das Relaismodul das Schließen und Unterbrechen des externen Stromkreises steuert, wodurch sich sein Arbeitszustand eine Sekunde lang ändert. Ausführliche Informationen zum Code finden Sie in `Teil 1- 1.2 Digitales Schreiben`.

source: **Phenomenon Picture**
de: **Phänomen Bild**
