Repository: sunfounder/vincent-kit
Catalog: docs/source/locale/*/LC_MESSAGES/2.22_potentiometer.po
Languages: de

source: **Overview**
de: **Überblick**

source: In this lesson, you will learn about Potentiometer. Potentiometer is a resistor component with 3 terminals and its resistance value can be adjusted according to some regular variation.
de: In dieser Lektion lernen Sie das Potentiometer kennen. Das Potentiometer ist eine Widerstandskomponente mit 3 Anschlüssen und sein Widerstandswert kann durch regelmäßige Abweichungen eingestellt werden.

source: **Components Required**
de: **Erforderliche Komponenten**

source: **Component Introduction**
de: **Komponenteneinführung**

source: Potentiometer usually consists of resistor and movable brush. When the brush is moving along the resistor, there is a certain resistance or voltage output depending on the displacement.
de: Das Potentiometer besteht normalerweise aus einem Widerstand und einer beweglichen Bürste. Wenn sich die Bürste entlang des Widerstands bewegt, gibt es abhängig von der Verschiebung einen bestimmten Widerstand oder eine bestimmte Spannung.

source: The functions of the potentiometer in the circuit are as follows:
de: Die Funktionen des Potentiometers in der Schaltung sind wie folgt:

source: **Serving as a voltage divider**
de: **Dient als Spannungsteiler**

source: Potentiometer is a continuously adjustable resistor. When you adjust the shaft or sliding handle of the potentiometer, the movable contact will slide on the resistor. At this point, a voltage can be output depending on the voltage applied onto the potentiometer and the angle the movable arm has rotated to or the distance it moves.
de: Das Potentiometer ist ein stufenlos einstellbarer Widerstand. Wenn Sie die Welle oder den Schiebegriff des Potentiometers einstellen, gleitet der bewegliche Kontakt auf dem Widerstand. Zu diesem Zeitpunkt kann eine Spannung ausgegeben werden, die von der an das Potentiometer angelegten Spannung und dem Winkel abhängt, in den sich der bewegliche Arm gedreht hat, oder von der Entfernung, um die er sich bewegt.

source: **Serving as a rheostat**
de: **Als Rheostat dienen**

source: When the potentiometer is used as a rheostat, connect the middle pin and one of the other 2 pins in the circuit. Thus you can get a smoothly and continuously changed resistance value cused by moving contact.
de: Wenn das Potentiometer als Rheostat verwendet wird, verbinden Sie den mittleren Stift und einen der anderen 2 Stifte im Stromkreis. Auf diese Weise erhalten Sie einen reibungslosen und kontinuierlich geänderten Widerstandswert, der durch beweglichen Kontakt ermittelt wird.

source: **Serving as a current controller**
de: **Dient als Stromregler**

source: When the potentiometer acts as a current controller, the sliding contact terminal must be connected as one of the output terminals.
de: Wenn das Potentiometer als Stromregler fungiert, muss die Schiebekontaktklemme als eine der Ausgangsklemmen angeschlossen werden.

source: In this example, we use the analog pin (A0) to read the value of the potentiometer. By rotating the axis of the potentiometer, you can change the distribution of resistance among these three pins, changing the voltage on the middle pin. When the resistance between the middle and a outside pin connected to 5V is close to zero (and the resistance between the middle and the other outside pin is close to 10kΩ), the voltage at the middle pin is close to 5 V. The reverse operation (the resistance between the middle and a outside pin connected to 5V is close to 10kΩ) will make the voltage at the middle pin be close to 0V.
de: In diesem Beispiel verwenden wir den analogen Pin (A0), um den Wert des Potentiometers abzulesen. Durch Drehen der Achse des Potentiometers können Sie die Widerstandsverteilung zwischen diesen drei Stiften ändern und die Spannung am mittleren Stift ändern. Wenn der Widerstand zwischen dem mittleren und einem an 5 V angeschlossenen Außenstift nahe Null liegt (und der Widerstand zwischen dem mittleren und dem anderen Außenstift nahe 10 kΩ liegt), liegt die Spannung am Mittelstift nahe bei 5 V. Der umgekehrte Vorgang (Der Widerstand zwischen dem mittleren und einem an 5 V angeschlossenen Außenstift liegt nahe bei 10 kΩ) Die Spannung am mittleren Stift liegt nahe bei 0 V.

source: **Schematic Diagram**
de: **Schematische Darstellung**

source: After uploading the codes to the Mega2560 board, you can open the serial monitor to see the reading value of the pin. When rotating the axis of the potentiometer, the serial port monitor will print the value 「0」~「1023」. For the detailed explanation of code, turn to check :ref:`1.5 Analog Read`.
de: Nachdem Sie die Codes auf die Mega2560-Karte hochgeladen haben, können Sie den seriellen Monitor öffnen, um den Lesewert des Pins anzuzeigen. Beim Drehen der Achse des Potentiometers druckt der Monitor der seriellen Schnittstelle den Wert 「0」 ~ 「1023」. Eine ausführliche Erläuterung des Codes finden Sie in `Teil 1- 1.5 Analog Read`.

source: **Phenomenon Picture**
de: **Phänomen Bild**
