Repository: sunfounder/vincent-kit
Catalog: docs/source/locale/*/LC_MESSAGES/2.24_mpr121_module.po
Languages: de

source: 2.24 MPR121 Module
de: 2.24 MPR121-Modul

source: **Overview**
de: **Überblick**

source: In this lesson, you will learn how to use MPR121. It's a good option when you want to add a lot of touch switches to your project. The electrode of MPR121 can be extended with a conductor. If you connect a wire to a banana, you can turn the banana into a touch switch, thus realizing projects such as fruit piano.
de: In dieser Lektion lernen Sie, wie Sie MPR121 verwenden. Dies ist eine gute Option, wenn Sie Ihrem Projekt viele Touch-Schalter hinzufügen möchten. Die Elektrode von MPR121 kann mit einem Leiter verlängert werden. Wenn Sie einen Draht an eine Banane anschließen, können Sie die Banane in einen Berührungsschalter verwandeln und so Projekte wie Obstklavier realisieren.

source: **Components Required**
de: **Erforderliche Komponenten**

source: **Component Introduction**
de: **Komponenteneinführung**

source: Add lots of touch sensors to your next project with this easy-to-use 12-channel capacitive touch sensor breakout board, starring the MPR121. This chip can handle up to 12 individual touch pads.
de: Fügen Sie Ihrem nächsten Projekt viele Berührungssensoren hinzu, indem Sie dieses benutzerfreundliche kapazitive 12-Kanal-Breakout-Board für Berührungssensoren mit dem MPR121 verwenden. Dieser Chip kann bis zu 12 einzelne Touchpads verarbeiten.

source: The MPR121 has support for only I2C, which can be implemented with nearly any microcontroller. You can select one of 4 addresses with the ADDR pin, for a total of 48 capacitive touch pads on one I2C 2-wire bus. Using this chip is a lot easier than doing the capacitive sensing with analog inputs: it handles all the filtering for you and can be configured for more/less sensitivity.
de: Der MPR121 unterstützt nur I2C, das mit nahezu jedem Mikrocontroller implementiert werden kann. Mit dem ADDR-Pin können Sie eine der 4 Adressen auswählen, um insgesamt 48 kapazitive Touchpads auf einem I2C-2-Draht-Bus zu verwenden. Die Verwendung dieses Chips ist viel einfacher als die kapazitive Erfassung über einen Analogeingang: Er kann alle Filter für Sie übernehmen und für eine höhere / niedrigere Empfindlichkeit konfiguriert werden.

source: When the MPR121 senses a change, it pulls an interrupt pin LOW. The control board going to check that pin to see if it is LOW during the loop. To do this, this sensor also needs access to another digital pin.
de: Wenn der MPR121 eine Änderung erkennt, zieht er einen Interrupt-Pin LOW. Die Steuerplatine überprüft diesen Pin, um festzustellen, ob er während der Schleife LOW ist. Dazu benötigt dieser Sensor auch Zugriff auf einen anderen digitalen Pin.

source: **Electrodes**
de: **Elektroden**

source: Electrode is a touch sensor. Typically, electrodes can just be some piece of metal, or a wire. But some times depending on the length of our wire, or the material the electrode is on, it can make triggering the sensor difficult. For this reason, the MPR121 allows you to configure what is needed to trigger and untrigger an electrode.
de: Die Elektrode ist ein Berührungssensor. Typischerweise können Elektroden nur ein Stück Metall oder ein Draht sein. Abhängig von der Länge des Drahtes oder dem Material auf der Elektrode kann es jedoch manchmal schwierig sein, den Sensor auszulösen. Aus diesem Grund können Sie mit dem MPR121 konfigurieren, was zum Auslösen und Auslösen einer Elektrode erforderlich ist.

source: In this example, we insert MPR121 into the breadboard. Get the GND of MPR121 connected to GND, 3.3V to 3V3, IRQ to the digital pin 2, SCL to the pin SCL(21), and SDA to the pin SDA(20). There are 12 electrodes for touch sensing. Note: MPR121 is powered by 3.3V, not 5V.
de: In diesem Beispiel fügen wir MPR121 in das Steckbrett ein. Stellen Sie die GND von MPR121 an GND, 3,3 V an 3 V3, IRQ an den digitalen Pin 2, SCL an den Pin SCL (21) und SDA an den Pin SDA (20). Es gibt 12 Elektroden für die Berührungserkennung. Hinweis: Der MPR121 wird mit 3,3 V und nicht mit 5 V betrieben.

source: **Schematic Diagram**
de: **Schematische Darstellung**

source: The codes use the `MPR121_JM. h library <https://github.com/sunfounder/sunfounder_vincent_kit_for_arduino/tree/master/library>`_. . Turn to :ref:`4.1 Add Libraries` for information on how to import Libraries.
de: Die Codes verwenden den `MPR121_JM. h Bibliothek <https://github.com/sunfounder/sunfounder_vincent_kit_for_arduino/tree/master/library>`_. Informationen zum Importieren von Bibliotheken finden Sie in `Teil 4 - 4.1 Hinzufügen von Bibliotheken`.

source: After uploading the codes to the Mega2560 board, the touch state of pins of MPR121 「1」and「0」will be recorded in a 12 - bit boolean type of array that will be printed on the serial monitor.
de: Nach dem Hochladen der Codes auf die Mega2560-Karte wird der Touch-Status der Pins von MPR121 (1) und (0) angezeigt Aufgenommen in einem booleschen 12-Bit-Array, das auf dem seriellen Monitor gedruckt wird.

source: **Code Analysis**
de: **Code-Analyse**

source: The function of the module is included in the library MPR121_JM.h.
de: Die Funktion des Moduls ist in der Bibliothek MPR121_JM.h enthalten.

source: **Library Functions：**
de: **Bibliotheksfunktionen:**

source: Creates a new instance of the MPR121.
de: Erstellt eine neue Instanz des MPR121.

source: irqpin: the interrupt request pin.
de: irqpin: der Interrupt-Anforderungs-Pin.

source: touThresh: Touch threshold，the electrode is recognized as a threshold of the 「Touch」 state.
de: touThresh: : Berührungsschwelle, Die Elektrode wird als Schwelle des Zustands 「Berührung」 recognized erkannt.

source: relThresh: Release threshold，the electrode is recognized as a threshold of the 「Release」 state.
de: relThresh: Freigabeschwelle, Die Elektrode wird als Schwelle des Zustands 「Freigabe」 recognized erkannt.

source: The range of the electrode data value is 0~255. For typical touch application, the threshold value can be in range 0x05~0x30 for example. The smaller the value, the more sensitive it is. The setting of the threshold is depended on the actual application.Typically the touch threshold is a little bigger than the release threshold to touch debounce and hysteresis.
de: Der Bereich des Elektrodendatenwerts liegt zwischen 0 und 255. Für eine typische Berührungsanwendung kann der Schwellenwert beispielsweise im Bereich von 0x05 bis 0x30 liegen. Je kleiner der Wert, desto empfindlicher ist er. Die Einstellung des Schwellenwerts hängt von der tatsächlichen Anwendung ab. Im Allgemeinen ist die Berührungsschwelle geringfügig größer als die Freigabeschwelle für das Entprellen und die Hysterese von Berührungen.

source: Setup MPR121 module.
de: MPR121-Modul einrichten.

source: Make interrupt judgment, when the electrode state changes, the function returns a Boolean value 「0」.
de: Wenn sich der Elektrodenzustand ändert, gibt die Funktion einen Booleschen Wert 「0」 returns zurück.

source: The touch state of the electrode produces a Boolean value. The function accumulates the Boolean values generated by all the electrodes in sequence into a 12-bit binary number as the return value. If the first and eleventh electrodes are touched, 「100000000010」 is returned.
de: Der Berührungszustand der Elektrode erzeugt einen Booleschen Wert. Diese Funktion akkumuliert die von allen Elektroden nacheinander erzeugten Booleschen Werte in einer 12-Bit-Binärzahl als Rückgabewert. Wenn die erste und die elfte Elektrode berührt werden, wird (100000000010) zurückgegeben.

source: **Phenomenon Picture**
de: **Phänomen Bild**
