Repository: sunfounder/vincent-kit
Catalog: docs/source/locale/*/LC_MESSAGES/2.25_rotary_encoder_module.po
Languages: de

source: 2.25 Rotary Encoder Module
de: 2.25 Drehgebermodul

source: **Overview**
de: **Überblick**

source: In this lesson, you will learn about Rotary Encoder. A rotary encoder is an electronic switch with a set of regular pulses in strictly timing sequence. When used with IC, it can achieve increment, decrement, page turning and other operations such as mouse scrolling, menu selection, and so on.
de: In dieser Lektion lernen Sie den Drehgeber kennen. Ein Drehgeber ist ein elektronischer Schalter mit einer Reihe von regulären Impulsen in streng zeitlicher Reihenfolge. Bei Verwendung mit IC können Inkremente, Dekremente, Umblättern und andere Vorgänge wie Maus-Scrollen, Menüauswahl usw. ausgeführt werden.

source: **Components Required**
de: **Erforderliche Komponenten**

source: **Component Introduction**
de: **Komponenteneinführung**

source: There are mainly two types of rotary encoders: absolute and incremental (relative) encoders. An incremental one is used in this experiment.
de: Es gibt hauptsächlich zwei Arten von Drehgebern: Absolut- und Inkrementalgeber. In diesem Experiment wird ein inkrementelles verwendet.

source: Most rotary encoders have 5 pins with three functions of turning left & right and pressing down. Pin 1 and pin 2 are switch wiring terminals used to press. Pin 4 is generally connected to ground. Pin 3 and pin 5 are first connected to a pull-up resistor and then to VCC and they can generate two-phase square waves whose phase difference is 90°. Usually these waves are called channel A and channel B as shown below:
de: Die meisten Drehgeber haben 5 Stifte mit drei Funktionen: Drehen nach links und rechts und Drücken nach unten. Pin 1 und Pin 2 sind Schalterverdrahtungsklemmen, die zum Drücken verwendet werden. Pin 4 ist im Allgemeinen mit Masse verbunden. Pin 3 und Pin 5 werden zuerst mit dem Pull-up-Widerstand und dann mit VCC verbunden. Sie können eine zweiphasige Rechteckwelle mit einer Phasendifferenz von 90 ° erzeugen. Normalerweise werden diese Wellen wie unten gezeigt als Kanal A und Kanal B bezeichnet:

source: As shown on the right, when channel A changes from high level to low level, if channel B is high level, it indicates the rotary encoder spins clockwise (CW); if at that moment channel B is low level, it means spins counterclockwise (CCW). So if we read the value of channel B when channel A is low level, we can know in which direction the rotary encoder rotates.
de: Wie rechts gezeigt, wenn Kanal A von einem hohen auf einen niedrigen Pegel wechselt und Kanal B einen hohen Pegel aufweist, zeigt dies an, dass sich der Drehgeber im Uhrzeigersinn dreht (CW), wenn Kanal B zu diesem Zeitpunkt einen niedrigen Pegel aufweist, bedeutet dies, dass er sich gegen den Uhrzeigersinn dreht (CCW). Wenn wir also den Wert von Kanal B lesen, wenn Kanal A einen niedrigen Pegel aufweist, können wir wissen, in welche Richtung sich der Drehgeber dreht.

source: In this example, we can connect the Rotary Encoder pin directly to the Mega 2560 Board pin, connect the GND of the Rotary Encoder to GND, 「+」 to 5V, SW to digital pin 4, DT to digital pin 3, and CLK to digital pin 2.
de: In diesem Beispiel können wir den Drehgeberstift direkt mit dem Mega 2560 Board-Stift verbinden, die GND des Drehgebers mit GND verbinden, 「+」 mit 5 V, SW mit Digitalstift 4, DT mit Digitalstift 3 und CLK mit digitaler Pin 2.

source: **Schematic Diagram**
de: **Schematische Darstellung**

source: You will see the angular displacement of the rotary encoder printed on Serial Monitor. When you turn the rotary encoder clockwise, the angular displacement is increased; when turn it counterclockwise, the displacement is decreased. If you press the switch on the rotary encoder, the readings will return to zero.
de: Sie sehen die Winkelverschiebung des Drehgebers auf dem seriellen Monitor. Beim Drehen des Drehgebers im Uhrzeigersinn nimmt die Winkelverschiebung zu, beim Drehen gegen den Uhrzeigersinn nimmt die Verschiebung ab. Wenn Sie den Schalter am Drehgeber drücken, werden die Messwerte auf Null zurückgesetzt.

source: **Code Analysis**
de: **Code-Analyse**

source: When Rotary Encoder is used, the following situations of pin level will occur.
de: Wenn ein Drehgeber verwendet wird, treten die folgenden Situationen mit Pin-Pegel auf.

source: ① When rotating the shaft, dtPin will go from high level to low level.
de: ① Beim Drehen der Welle wechselt dtPin von einem hohen auf einen niedrigen Pegel.

source: ② clkPin will remain high level when the shaft rotates clockwise, otherwise it goes low level.
de: ② clkPin bleibt hoch, wenn sich die Welle im Uhrzeigersinn dreht, andernfalls wird es niedrig.

source: ③ When the shaft is pressed, swPin will have low level.
de: ③ Wenn die Welle gedrückt wird, hat swPin einen niedrigen Pegel.

source: From this, the program flow is shown on the right.
de: Daraus wird rechts der Programmablauf angezeigt.

source: For detailed analysis of potential state change judgment, please refer to :ref:`1.10 State Change Detection`.
de: Eine detaillierte Analyse der Beurteilung potenzieller Zustandsänderungen finden Sie in `Teil 1 - 1.10 Erkennung von Zustandsänderungen`.

source: **Phenomenon Picture**
de: **Phänomen Bild**
