Repository: sunfounder/vincent-kit
Catalog: docs/source/locale/*/LC_MESSAGES/2.28_sound_sensor_module.po
Languages: de

source: 2.28 Sound Sensor Module
de: 2.28 Schallsensormodul

source: **Overview**
de: **Überblick**

source: In this lesson, you will learn how to use a sound sensor module. The sound sensor module provides an easy way to detect sound and is generally used for detecting sound intensity.
de: In diesem Lektioin lernen Sie den Umgang mit dem Schallsensormodul. Das Schallsensormodul bietet eine einfache Möglichkeit zur Schallerkennung und wird normalerweise zur Erkennung der Schallintensität verwendet.

source: **Components Required**
de: **Erforderliche Komponenten**

source: **Component Introduction**
de: **Komponenteneinführung**

source: This module can be used for security, switch, and monitoring applications. Its accuracy can be easily adjusted for the convenience of usage.
de: Dieses Modul kann für Sicherheits-, Switch- und Überwachungsanwendungen verwendet werden. Die Genauigkeit kann für die Benutzerfreundlichkeit leicht angepasst werden.

source: It uses a microphone which supplies the input to an amplifier, peak detector and buffer. When the sensor detects a sound, it processes an output signal voltage which is sent to a micro-controller then performs necessary processing.
de: Es verwendet ein Mikrofon, das den Eingang zu einem Verstärker, einem Spitzendetektor und einem Puffer liefert. Wenn der Sensor Geräusche erkennt, verarbeitet er die Ausgangssignalspannung, sendet sie an den Mikrocontroller und führt dann die erforderliche Verarbeitung durch.

source: This module has two outputs:
de: Dieses Modul hat zwei Ausgänge:

source: ① AO: analog output, real-time output voltage signal of microphone.
de: ① AO: Analogausgang, Echtzeit-Ausgangsspannungssignal des Mikrofons.

source: ② DO: when the intensity of the sound reaches a certain threshold, the output is a high or low level signal. The threshold sensitivity can be achieved by adjusting the potentiometer.
de: ② DO: Wenn die Intensität des Tons einen bestimmten Schwellenwert erreicht, ist der Ausgang ein Signal mit hohem oder niedrigem Pegel. Die Schwellenempfindlichkeit kann durch Einstellen des Potentiometers erreicht werden.

source: In this example, we can directly connect the pin of Sound Sensor Module to the pin of Mega 2560 Board, connect the pin「G」 of Sound Sensor Module to GND, the pin 「+」to 5V, AO to analog pin A0, and D0 to digital pin 2.
de: In diesem Beispiel können wir den Pin des Soundsensormoduls direkt mit dem Pin der Mega 2560-Platine verbinden, den Pin 「G」 des Soundsensormoduls mit GND, den Pin 「+」 mit 5 V, AO mit dem analogen Pin A0 und D0 an digitalen Pin 2.

source: **Schematic Diagram**
de: **Schematische Darstellung**

source: After uploading the code to the Mega2560 board, you can open the serial monitor to see the read value of the pin. When the ambient sound gets louder, the digital reading is 「1」 (adjust the potentiometer of the module to modify the threshold to trigger the high level), and the reading value of the analog pin will change significantly; when the environment is quiet, the digital reading is 「0」 and the analog reading changes smoothly.
de: Nachdem Sie den Code auf die Mega2560-Karte hochgeladen haben, können Sie den seriellen Monitor öffnen, um den Lesewert des Pins anzuzeigen. Wenn der Umgebungsschall lauter wird, beträgt der digitale Messwert 「1」 (stellen Sie das Potentiometer des Moduls ein, um den Schwellenwert zu ändern und den hohen Pegel auszulösen), und der Lesewert des analogen Pins ändert sich erheblich. Wenn die Umgebung ruhig ist, ist der digitale Messwert 「0」 und der analoge Messwert ändert sich reibungslos.

source: The range of analog reading is「0」~「1023」, but influenced by the the environmental condition and the characteristics of sound sensor, the actual reading range may be smaller than the theoretical one. If an oscilloscope is used, the changing of analog reading of the sound sensor will be more obvious.
de: Der Bereich des analogen Lesens beträgt 「0」 ~ 「1023」, aber abhängig von den Umgebungsbedingungen und den Eigenschaften des Schallsensors kann der tatsächliche Lesebereich kleiner sein als der theoretische. Wenn ein Oszilloskop verwendet wird, ist die Änderung des analogen Messwerts des Schallsensors offensichtlicher.

source: About the detail code explanation, refer to :ref:`1.5 Analog Read` and :ref:`1.4 Digital Read`.
de: Informationen zur Erläuterung des Detailcodes finden Sie in `Teil 1 -1.5 Analog Read` und `Teil 1- 1.4 Digital Read`.

source: **Phenomenon Picture**
de: **Phänomen Bild**
