Repository: sunfounder/vincent-kit
Catalog: docs/source/locale/*/LC_MESSAGES/2.29_water_sensor_module.po
Languages: de

source: 2.29 Water Sensor Module
de: 2.29 Wassersensormodul

source: **Overview**
de: **Überblick**

source: In this lesson, you will learn how to use a water sensor module. A water sensor module is designed for water detection, which can be widely used in sensing the rainfall, water level, even the liquid leakage.
de: In diesem Kurs lernen Sie den Umgang mit dem Wassersensormodul. Das Wassersensormodul ist für die Wassererkennung ausgelegt und kann häufig zur Erfassung von Niederschlag, Wasserstand und sogar Flüssigkeitsleckage verwendet werden.

source: **Components Required**
de: **Erforderliche Komponenten**

source: **Component Introduction**
de: **Komponenteneinführung**

source: Water Level Detection Sensor Module
de: Modul zur Erkennung des Wasserstands

source: This sensor works by having a series of exposed traces connected to ground. Interlaced between the grounded traces are the sense traces.
de: Dieser Sensor arbeitet mit einer Reihe freiliegender Leiterbahnen, die mit Masse verbunden sind. Zwischen den geerdeten Spuren befinden sich die Sinnesspuren.

source: The sensor traces have a weak pull-up resistor of 1 MΩ. The resistor will pull the sensor trace value high until a drop of water shorts the sensor trace to the grounded trace.
de: Die Sensorspuren haben einen schwachen Pull-up-Widerstand von 1 MΩ. Der Widerstand zieht den Sensor-Trace-Wert hoch, bis ein Wassertropfen den Sensor-Trace mit dem geerdeten Trace kurzschließt.

source: This item can judge the water level through with a series of exposed parallel wires stitch to measure the water droplet/water size.
de: Dieser Gegenstand kann den Wasserstand mit einer Reihe freiliegender paralleler Drähte beurteilen, um die Wassertropfen- / Wassergröße zu messen.

source: The core part of water level sensor is an amplification circuit composed of a transistor and several comb-shape PCB cables. When placed in water, the comb-shape cable will change its resistance with the depth of the water and convert the depth signal into an electrical signal, and output analog value can directly be used in the program function, then to achieve the function of water level alarm.
de: Der Kern des Wasserstandssensors ist eine Verstärkungsschaltung, die aus einem Transistor und mehreren kammförmigen Leiterplattenkabeln besteht. Wenn es in Wasser gelegt wird, ändert das kammförmige Kabel seinen Widerstand mit der Wassertiefe und wandelt das Tiefensignal in ein elektrisches Signal um. Der analoge Ausgangswert kann direkt in der Programmfunktion verwendet werden, um dann die Funktion des Wassers zu erreichen Füllstandsalarm.

source: In this example, we directly connect the pins of Water Sensor Module to pins of Mega 2560 Board. We use analog A0 to get the value of Water Sensor Module, and get the pin「S」of Water Sensor Module to A0, 「-」to GND, 「+」to 5V.
de: In diesem Beispiel verbinden wir die Stifte des Wassersensormoduls direkt mit den Stiften der Mega 2560-Platine. Wir verwenden analoges A0, um den Wert des Wassersensormoduls zu erhalten, und bringen den Pin 「S」 des Wassersensormoduls auf A0, 「-」 auf GND, 「+」 auf 5V.

source: **Schematic Diagram**
de: **Schematische Darstellung**

source: After uploading the code to the Mega2560 board, you can open the serial monitor to see the read value of the pin. As the water level rises, the readings increase. Readings vary within the range 「0」~「1023」, but influenced by the environmental condition and the characteristics of water level sensor, the actual reading range may be smaller than the theoretical range. Refer to Part 1-1.5 Analog Read to check the detail code explanation.
de: Nachdem Sie den Code auf die Mega2560-Karte hochgeladen haben, können Sie den seriellen Monitor öffnen, um den Lesewert des Pins anzuzeigen. Mit steigendem Wasserstand steigen die Messwerte. Die Messwerte variieren innerhalb des Bereichs 「0」 ~ 「1023」, aber abhängig von den Umgebungsbedingungen und den Eigenschaften des Wasserstandsensors kann der tatsächliche Messbereich kleiner sein als der theoretische Bereich. Siehe Teil 1- 1.5 Analog Read, um die Erklärung des Detailcodes zu überprüfen.

source: **Phenomenon Picture**
de: **Phänomen Bild**
