Repository: sunfounder/vincent-kit
Catalog: docs/source/locale/*/LC_MESSAGES/2.30_ir_obstacle_avoidance_sensor.po
Languages: de

source: 2.30 IR Obstacle Avoidance Sensor
de: 2.30 IR-Hindernisvermeidungssensor

source: **Overview**
de: **Überblick**

source: In this lesson, you will learn how to use IR Obstacle Avoidance Sensor. This module is commonly installed on the car and robot to judge the existence of the obstacles ahead. Also it is widely used in hand held device, water faucet and so on.
de: In diesem Lektion lernen Sie den Umgang mit Infrarot-Hindernisvermeidungssensoren. Dieses Modul wird normalerweise in Autos und Robotern installiert, um festzustellen, ob Hindernisse vor Ihnen liegen. Es ist auch weit verbreitet in Handgeräten, Wasserhähnen und so weiter.

source: **Components Required**
de: **Erforderliche Komponenten**

source: **Component Introduction**
de: **Komponenteneinführung**

source: An IR Obstacle Sensor works in accordance with the infrared reflection principle to detect obstacles. When there is no object, the infrared receiver receives no signals; when there is an object ahead which blocks and reflects the infrared light, the infrared receiver will receive signals.
de: Ein IR-Hindernissensor erkennt nach dem Infrarotreflexionsprinzip Hindernisse. Wenn kein Objekt vorhanden ist, empfängt der Infrarotempfänger kein Signal. Wenn ein Objekt vor Ihnen Infrarotlicht blockiert und reflektiert, empfängt der Infrarotempfänger das Signal.

source: We can directly connect the pins of IR Obstacle Sensor Module with the pins of Mega 2560 Board. The digital pin 2 is used to read the signal of IR Obstacle Avoidance Sensor Module. We get the VCC of IR Sensor Module connected to 5V, GND to GND, OUT to digital pin 2.
de: Wir können die Stifte des IR-Hindernissensormoduls direkt mit den Stiften der Mega 2560-Platine verbinden. Der digitale Pin 2 dient zum Lesen des Signals des IR-Hindernisvermeidungssensormoduls. Wir erhalten die VCC des IR-Sensormoduls an 5 V, GND an GND, OUT an digitalen Pin 2.

source: **Schematic Diagram**
de: **Schematische Darstellung**

source: Uploaded the codes to the Mega2560 board, you can see the readings of pins on the serial monitor. When IR Obstacle Avoidance Sensor Module detects there is something covering ahead, there appears 「0」on the serial monitor; otherwise,「1」is displayed. Refer to:ref:`1.4 Digital Read` to check the detail code explanation.
de: Wenn Sie die Codes auf die Mega2560-Karte hochgeladen haben, können Sie die Messwerte der Pins auf dem seriellen Monitor anzeigen. Wenn das IR-Hindernisvermeidungssensormodul feststellt, dass sich etwas vor Ihnen befindet, wird auf dem seriellen Monitor 「0 appears angezeigt. Andernfalls wird 「1」 angezeigt. Informationen zur Erläuterung des Detailcodes finden Sie in `Teil 1- 1.4 Digital Read`.

source: **Phenomenon Picture**
de: **Phänomen Bild**
