Repository: sunfounder/vincent-kit
Catalog: docs/source/locale/*/LC_MESSAGES/2.31_pir_module.po
Languages: de

source: 2.31 PIR Module
de: 2.31 PIR-Modul

source: **Overview**
de: **Überblick**

source: In this lesson, you will learn how to use PIR Module. The PIR sensor detects infrared heat radiation or the presence of organisms that emit infrared heat radiation. This module is widely used in daily life for our intruder alarm and visiting prompt.
de: In dieser Lektion lernen Sie den Umgang mit dem PIR-Modul. Der PIR-Sensor erfasst Infrarot-Wärmestrahlung oder das Vorhandensein eines biologischen Körpers, der Infrarot-Wärmestrahlung emittiert. Dieses Modul wird im täglichen Leben häufig für unseren Einbruchalarm und unsere Besuchsaufforderung verwendet.

source: **Components Required**
de: **Erforderliche Komponenten**

source: **Component Introduction**
de: **Komponenteneinführung**

source: The PIR sensor is split into two slots that are connected to a differential amplifier. Whenever a stationary object is in front of the sensor, the two slots receive the same amount of radiation and the output is zero. Whenever a moving object is in front of the sensor, one of the slots receives more radiation than the other, which makes the output fluctuate high or low. This change in output voltage is a result of detection of motion.
de: Der PIR-Sensor ist in zwei Steckplätze unterteilt, die an einen Differenzverstärker angeschlossen sind. Immer wenn sich ein stationäres Objekt vor dem Sensor befindet, empfangen beide Schlitze die gleiche Strahlungsmenge und der Ausgang ist Null. Immer wenn sich ein sich bewegendes Objekt vor dem Sensor befindet, empfängt einer der Schlitze mehr Strahlung als der andere, wodurch der Ausgang stark oder niedrig schwankt. Diese Änderung der Ausgangsspannung ist ein Ergebnis der Bewegungserkennung.

source: After the sensing module is wired, there is a one-minute initialization. During the initialization, module will output for 0~3 times at intervals. Then the module will be in the standby mode. Please keep the interference of light source and other sources away from the surface of the module so as to avoid the misoperation caused by the interfering signal. Even you'd better use the module without too much wind, because the wind can also interfere with the sensor. Two trigger modes: (choosing different modes by using the jumper cap).
de: Nachdem das Sensormodul verdrahtet wurde, erfolgt eine einminütige Initialisierung. Während der Initialisierung wird das Modul in Intervallen 0 bis 3 Mal ausgegeben. Dann befindet sich das Modul im Standby-Modus. Bitte halten Sie die Lichtquelle und andere Störungen von der Oberfläche des Moduls fern, um Fehlbedienungen aufgrund von Störsignalen zu vermeiden. Auch Sie sollten das Modul besser ohne zu viel Wind verwenden, da der Wind auch den Sensor stören kann. Zwei Triggermodi: (Auswahl verschiedener Modi mithilfe der Überbrückungskappe).

source: **Distance Adjustment**
de: **Abstandseinstellung**

source: Turning the knob of the distance adjustment potentiometer clockwise, the range of sensing distance increases, and the maximum sensing distance range is about 0-7 meters. If turn it anticlockwise, the range of sensing distance is reduced, and the minimum sensing distance range is about 0-3 meters.
de: Drehen Sie den Knopf des Potentiometers zur Entfernungseinstellung im Uhrzeigersinn, um den Erfassungsentfernungsbereich zu vergrößern. Der maximale Erfassungsentfernungsbereich beträgt ca. 0-7 Meter. Wenn Sie ihn gegen den Uhrzeigersinn drehen, verringert sich die Reichweite der Erfassungsentfernung, und die minimale Reichweite der Erfassungsentfernung beträgt etwa 0 bis 3 Meter.

source: **Delay Adjustment**
de: **Verzögerungseinstellung**

source: Rotate the knob of the delay adjustment potentiometer clockwise, you can also see the sensing delay increasing. The maximum of the sensing delay can reach up to 300s. On the contrary, if rotate it anticlockwise, you can shorten the delay with a minimum of 5s.
de: Drehen Sie den Knopf des Verzögerungseinstellpotentiometers im Uhrzeigersinn. Sie können auch sehen, wie die Erfassungsverzögerung zunimmt. Das Maximum der Erfassungsverzögerung kann bis zu 300 s erreichen. Im Gegenteil, wenn Sie es gegen den Uhrzeigersinn drehen, können Sie die Verzögerung um mindestens 5 Sekunden verkürzen.

source: Two trigger modes: (choosing different modes by using the jumper cap).
de: Zwei Triggermodi: (Auswahl verschiedener Modi mithilfe der Überbrückungskappe).

source: **H:** **Repeatable trigger mode**, after sensing the human body, the module outputs high level. During the subsequent delay period, if somebody enters the sensing range,the output will keep being the high level.
de: **H: Wiederholbarer Triggermodus**, Nach dem Erfassen des menschlichen Körpers gibt das Modul einen hohen Pegel aus. Wenn während der nachfolgenden Verzögerungszeit jemand den Erfassungsbereich betritt, bleibt der Ausgang auf dem hohen Pegel.

source: **L**\ ：\ **Non-repeatable trigger mode**, outputs high level when it senses the human body. After the delay, the output will change from high level into low level automatically.
de: **L**\ ：\ **Nicht wiederholbarer Triggermodus**, der einen hohen Pegel ausgibt, wenn er den menschlichen Körper erfasst. Nach der Verzögerung wechselt der Ausgang automatisch von einem hohen zu einem niedrigen Pegel.

source: PIR can only be installed indoors, and its false alarm rate has a great relationship with the location and mode of installation. The correct use should meet the following conditions:
de: PIR kann nur in Innenräumen installiert werden, und seine Fehlalarmrate hängt stark vom Standort und der Art der Installation ab. Die korrekte Verwendung sollte die folgenden Bedingungen erfüllen:

source: 1. It should be 2.0-2.2 meters above the ground.
de: 1. Es sollte 2,0-2,2 Meter über dem Boden sein.

source: 2. Stay away from air conditioners, refrigerators, stoves and other places where air temperature changes `apparently <https://cn.bing.com/dict/search?q=apparently&FORM=BDVSP6&mkt=zh-cn>`__.
de: 2. Halten Sie sich von Klimaanlagen, Kühlschränken, Öfen und anderen Orten fern, an denen sich die Lufttemperatur anscheinend `ändert <https://cn.bing.com/dict/search?q=apparently&FORM=BDVSP6&mkt=zh-cn>`__.

source: 3. No screen, furniture, large-scale bonsai or other isolation objects shall be detected within the detection range.
de: 3. Innerhalb des Erfassungsbereichs dürfen keine Bildschirme, Möbel, großflächigen Bonsai oder andere Isolationsobjekte erkannt werden.

source: 4. Don't face straightly toward the window, otherwise the disturbance of the hot air flow outside the window and the movement of people will cause false alarm.
de: 4. Gehen Sie nicht direkt zum Fenster, da sonst die Störung des Heißluftstroms außerhalb des Fensters und die Bewegung von Personen zu Fehlalarmen führen.

source: 5. Do not use in areas with strong airflow.
de: 5. Nicht in Bereichen mit starkem Luftstrom verwenden.

source: 6. The sensitivity of PIR to human body is also closely related to the direction of movement. It is least sensitive to radial movement and most sensitive to the movement in the crosscutting direction.
de: 6. Die Empfindlichkeit von PIR gegenüber dem menschlichen Körper hängt auch eng mit der Bewegungsrichtung zusammen. Es ist am wenigsten empfindlich gegenüber radialen Bewegungen und am empfindlichsten gegenüber Bewegungen in Querschnittsrichtung.

source: In this example, we can connect the pins of Sound Sensor Module to the pins of Mega 2560 Board directly, and we use digital pin 2 to read the signal of PIR Module. Connect the VCC of PIR Module to 5V, GND to GND, and OUT to digital pin NOTE: you can remove the PIR cover to see the pin mark.
de: In diesem Beispiel können wir die Pins des Soundsensormoduls direkt mit den Pins auf der Mega 2560-Platine verbinden und mit dem digitalen Pin 2 das Signal des PIR-Moduls lesen. Verbinden Sie den VCC des PIR-Moduls mit 5 V, GND mit GND und OUT mit dem digitalen Pin. HINWEIS: Sie können die PIR-Abdeckung entfernen, um die Pin-Markierung zu sehen.

source: **Schematic Diagram**
de: **Schematische Darstellung**

source: After the codes are uploaded to the Mega2560 board, you can open the serial monitor to see the reading value of the pin. When PIR Module detects activity nearby, the serial monitor will display 「1」; otherwise, it will display 「0」. Check :ref:`1.4 Digital Read` detail code explanation.
de: Nachdem die Codes auf die Mega2560-Karte hochgeladen wurden, können Sie den seriellen Monitor öffnen, um den Lesewert des Pins anzuzeigen. Wenn das PIR-Modul Aktivitäten in der Nähe erkennt, zeigt der serielle Monitor 「1」 an. Andernfalls wird 「0」 angezeigt. Weitere Informationen zum Code finden Sie in `Teil 1- 1.4 Digital Read`.

source: There are two potentiometers on the PIR module: one is to adjust **sensitivity** and the other is to adjust the **detection distance**. In order to make the PIR module work better, you need to try to adjust these two potentiometers.
de: Das PIR-Modul verfügt über zwei Potentiometer: Das eine dient zum Einstellen der **Empfindlichkeit** und das andere zum Einstellen des **Erfassungsabstands**. Damit das PIR-Modul besser funktioniert, müssen Sie versuchen, diese beiden Potentiometer einzustellen.

source: **Phenomenon Picture**
de: **Phänomen Bild**
