Repository: sunfounder/vincent-kit
Catalog: docs/source/locale/*/LC_MESSAGES/2.35_rfid-rc522_module.po
Languages: de

source: 2.35 RFID-RC522 Module
de: 2.35 RFID-RC522-Modul

source: **Overview**
de: **Überblick**

source: In this lesson, you will learn how to use RFID Module. RFID is the abbreviation of Radio Frequency Identification. Its working principle is to carry on the contactless data communication between the reader and the label to achieve the goal of identifying the target. The application of RFID is very extensive, currently the typical applications are animal chips, immobilizer, access control, parking control, production chain automation, material management and so on.
de: In dieser Lektion lernen Sie, wie Sie das RFID-Modul verwenden. RFID ist eine Abkürzung für Radio Frequency Identification. Sein Arbeitsprinzip besteht darin, eine berührungslose Datenkommunikation zwischen dem Lesegerät und dem Etikett durchzuführen, um den Zweck der Identifizierung des Ziels zu erreichen. RFID hat ein breites Anwendungsspektrum. Die derzeit typischen Anwendungen sind Tierchips, Diebstahlsicherungen, Zugangskontrolle, Parkkontrolle, Automatisierung der Produktionskette und Materialmanagement.

source: **Components Required**
de: **Erforderliche Komponenten**

source: **Component Introduction**
de: **Komponenteneinführung**

source: Radio Frequency Identification (RFID) refers to technologies that involve using wireless communication between an object (or tag) and an interrogating device (or reader) to automatically track and identify such objects. The tag transmission range is limited to several meters from the reader. A clear line of sight between the reader and tag is not necessarily required.
de: Radio Frequency Identification (RFID) bezeichnet eine Technologie, bei der eine drahtlose Kommunikation zwischen einem Objekt (oder Tag) und einem Abfragegerät (oder Lesegerät) verwendet wird, um solche Objekte automatisch zu verfolgen und zu identifizieren. Die Tag-Übertragungsreichweite ist auf mehrere Meter vom Lesegerät begrenzt. Eine klare Sichtlinie zwischen Lesegerät und Etikett ist nicht unbedingt erforderlich.

source: Most tags contain at least one integrated circuit (IC) and an antenna. The microchip stores information and is responsible for managing the radio frequency (RF) communication with the reader. Passive tags do not have an independent energy source and depend on an external electromagnetic signal, provided by the reader, to power their operations. Active tags contain an independent energy source, such as a battery. Thus, they may have increased processing, transmission capabilities and range.
de: Die meisten Tags enthalten mindestens eine integrierte Schaltung (IC) und eine Antenne. Der Mikrochip speichert Informationen und ist für die Verwaltung der Hochfrequenzkommunikation mit dem Lesegerät verantwortlich. Passive Tags haben keine unabhängige Energiequelle und sind auf ein externes elektromagnetisches Signal angewiesen, das vom Lesegerät bereitgestellt wird, um ihren Betrieb zu betreiben. Aktive Tags enthalten eine unabhängige Energiequelle, z. B. eine Batterie. Somit können sie eine erhöhte Verarbeitung, Übertragungsfähigkeit und Reichweite aufweisen.

source: MF RC522 is a highly integrated read and write card chip applied to the 13.56MHz contactless communication. Launched by the NXP Company, it is a low-voltage, low-cost, and small-sized non-contact card chip, a best choice of intelligent instrument and portable hand held device.
de: MF RC522 ist ein hochintegrierter Lese- und Schreibkartenchip für die kontaktlose 13,56-MHz-Kommunikation. Es wurde von der NXP Company auf den Markt gebracht und ist ein berührungsloser, kostengünstiger und kleiner Niederspannungs-Kartenchip, der die beste Wahl für intelligente Instrumente und tragbare Handgeräte darstellt.

source: The MF RC522 uses advanced modulation and demodulation concept which fully presented in all types of 13.56MHz passive contactless communication methods and protocols. In addition, it supports rapid CRYPTO1 encryption algorithm to verify MIFARE products.
de: Der MF RC522 verwendet ein fortschrittliches Modulations- und Demodulationskonzept, das in allen Arten von passiven kontaktlosen Kommunikationsmethoden und -protokollen mit 13,56 MHz vollständig dargestellt wird. Darüber hinaus unterstützt es den schnellen CRYPTO1-Verschlüsselungsalgorithmus zur Überprüfung von MIFARE-Produkten.

source: MFRC522 also supports MIFARE series of high-speed non-contact communication, with a two-way data transmission rate up to 424kbit/s. As a new member of the 13.56MHz highly integrated reader card series, MF RC522 is much similar to the existing MF RC500 and MF RC530 but there also exists great differences.
de: Der MFRC522 unterstützt auch die berührungslose Hochgeschwindigkeitskommunikation der MIFARE-Serie mit einer bidirektionalen Datenübertragungsrate von bis zu 424 kbit / s. Als neues Mitglied der hochintegrierten 13,56-MHz-Lesekartenserie ist der MF RC522 dem vorhandenen MF RC500 und MF RC530 sehr ähnlich, es gibt jedoch auch große Unterschiede.

source: It communicates with the host machine via the serial manner which needs less wiring. You can choose between SPI, I2C and serial UART mode (similar to RS232), which helps reduce the connection, save PCB board space (smaller size), and reduce cost.
de: Es kommuniziert mit dem Host-Computer über die serielle Weise, die weniger Verkabelung benötigt. Sie können zwischen SPI-, I2C- und seriellem UART-Modus (ähnlich wie RS232) wählen, um die Verbindung zu reduzieren, Platz auf der Leiterplatte zu sparen (kleinere Größe) und Kosten zu senken.

source: In this example, we insert the RFID into the breadboard. Get the 3.3V of RFID connected to 3.3V, GND to GND, RST to pin 2, SDA to pin 6, SCK to pin 5, MOSI to pin 4, MISO to pin 3 and IRQ to pin 7.
de: In diesem Beispiel fügen wir die RFID in das Steckbrett ein. Lassen Sie die 3,3 V RFID an 3,3 V, GND an GND, RST an Pin 2, SDA an Pin 6, SCK an Pin 5, MOSI an Pin 4, MISO an Pin 3 und IRQ an Pin 7 anschließen.

source: **Schematic Diagram**
de: **Schematische Darstellung**

source: The codes use the `rfid1.h library <https://github.com/sunfounder/sunfounder_vincent_kit_for_arduino/tree/master/library>`_. About how to import the library, please refer to :ref:`4.1 Add Libraries`.
de: Die Codes verwenden die `Bibliothek rfid1.h <https://github.com/sunfounder/sunfounder_vincent_kit_for_arduino/tree/master/library>`_. Informationen zum Importieren der Bibliothek finden Sie in `Teil 4 - 4.1 Hinzufügen von Bibliotheken`.

source: Uploaded the codes to the Mega2560 board, you can get your RFID card (secret key) close to the RFID Reader. The module will read the card information and then print it on the serial monitor.
de: Wenn Sie die Codes auf die Mega2560-Karte hochgeladen haben, können Sie Ihre RFID-Karte (geheimer Schlüssel) in die Nähe des RFID-Lesegeräts bringen. Das Modul liest die Karteninformationen und druckt sie dann auf dem seriellen Monitor aus.

source: **Code Analysis**
de: **Code-Analyse**

source: The functions of the module are included in the library rfid1.h.
de: Die Funktionen des Moduls sind in der Bibliothek rfid1.h enthalten.

source: **Library Functions：**
de: **Bibliotheksfunktionen:**

source: Create a new instance of the rfid1 class that represents a particular RFID module attached to your Arduino .
de: Erstellen Sie eine neue Instanz der Klasse rfid1, die ein bestimmtes RFID-Modul darstellt, das an Ihr Arduino angeschlossen ist.

source: Pin configuration.
de: Pin-Konfiguration.

source: IRQ_PIN,SCK_PIN,MOSI_PIN,MISO_PIN: the pins used for the SPI communication.
de: IRQ_PIN,SCK_PIN,MOSI_PIN,MISO_PIN: Die für die SPI-Kommunikation verwendeten Pins.

source: SDA_PIN: Synchronous data adapter.
de: SDA_PIN: Synchroner Datenadapter.

source: RST_PIN: The pins used for reset.
de: RST_PIN: Die zum Zurücksetzen verwendeten Pins.

source: Initialize the RFID.
de: Initialisieren Sie die RFID.

source: Search card and read card type, and the function will return the current read status of RFID and return MI_OK if successed.
de: Suchkarte und Lesekartentyp, und die Funktion gibt den aktuellen Lesestatus von RFID zurück und gibt MI_OK zurück, wenn dies erfolgreich ist.

source: reqMode: Search methods. PICC_REQIDL is defined that 0x26 command bits (Search the cards that does not in the sleep mode in the antenna area).
de: reqMode: Suchmethoden. PICC_REQIDL ist definiert als 0x26 Befehlsbits (Durchsuchen Sie die Karten, die sich nicht im Ruhemodus befinden, im Antennenbereich).

source: \*TagType: It is used to store card type, and its value can be 4byte (e.g. 0x0400).
de: * TagType: Dient zum Speichern des Kartentyps und kann einen Wert von 4 Byte haben (z. B. 0x0400).

source: This function decodes the four-digit hexadecimal number of \*tagType into the specific card type and returns a string. If passed 0x0400, "MFOne-S50" will be returned.
de: Diese Funktion decodiert die vierstellige Hexadezimalzahl von \* tagType in den jeweiligen Kartentyp und gibt eine Zeichenfolge zurück. Bei Übergabe von 0x0400 wird "MFOne-S50" zurückgegeben.

source: Prevent conflict, and read the card serial number. The function will return the current reading status of RFID. It returns MI_OK if successed.
de: Verhindern Sie Konflikte und lesen Sie die Seriennummer der Karte. Die Funktion gibt den aktuellen Lesestatus von RFID zurück. Bei Erfolg wird MI_OK zurückgegeben.

source: \*serNum: It is used to store the card serial number, and return the 4 bytes card serial number. The 5th byte is recheck byte(e.g. e.g. my magnetic card ID is 5AE4C955).
de: \* serNum: Hiermit wird die Kartenseriennummer gespeichert und die 4-Byte-Kartenseriennummer zurückgegeben. Das 5. Byte ist ein erneutes Überprüfungsbyte (z. B. meine Magnetkarten-ID ist 5AE4C955).

source: **Phenomenon Picture**
de: **Phänomen Bild**
