Repository: sunfounder/vincent-kit
Catalog: docs/source/locale/*/LC_MESSAGES/2.5_7-segment_display.po
Languages: de

source: 2.5 7-Segment Display
de: 2.5 7-Segment-Anzeige

source: Overview
de: Überblick

source: In this lesson, you will learn something about 7-Segment Display. 7-Segment Display has so many advantages that it is widely used in electrical equipments, especially in household appliances that display numerical information, such as display, air conditioner, water heater, refrigerator and so on. LEDs on the 7-Segment Display emit light by the input of different electrical signals to the different pins of it. The numerical information it can display includes time, date, temperature and so on.
de: In diesem Lektion lernen Sie 7-Segment-Displays kennen. Das 7-Segment-Display hat viele Vorteile und wird daher häufig in elektrischen Geräten verwendet, insbesondere in Haushaltsgeräten, die digitale Informationen anzeigen, wie Bildschirme, Klimaanlagen, Warmwasserbereiter, Kühlschränke usw. LEDs auf dem 7-Segment-Display senden Licht durch die Eingabe verschiedener elektrischer Signale an die verschiedenen Pins. Zu den numerischen Informationen, die angezeigt werden können, gehören Uhrzeit, Datum, Temperatur usw.

source: Components Required
de: Erforderliche Komponenten

source: Component Introduction
de: Komponenteneinführung

source: A 7-segment display is an 8-shaped component which packages 7 LEDs. Each LED is called a segment – when energized, one segment forms part of a numeral to be displayed.
de: Ein 7-Segment-Display ist eine 8-förmige Komponente, die 7 LEDs enthält. Jede LED wird als Segment bezeichnet. Bei Erregung ist ein Segment Teil einer anzuzeigenden Ziffer.

source: There are two types of pin connection: Common Cathode (CC) and Common Anode (CA). As the name suggests, a CC display has all the cathodes of the 7 LEDs connected when a CA display has all the anodes of the 7 segments connected. In this kit, we use the former.
de: Es gibt zwei Arten von Pin-Verbindungen: Common Cathode (CC) und Common Anode (CA). Wie der Name schon sagt, verbindet die CC-Anzeige alle Kathoden der 7 LEDs, wenn die CA-Anzeige alle Anoden der 7 Segmente verbindet. In diesem Kit verwenden wir das erstere.

source: Each of the LEDs in the display is given a positional segment with one of its connection pins led out from the rectangular plastic package. These LED pins are labeled from "a" through to "g" representing each individual LED. The other LED pins are connected together forming a common pin. So by forward biasing the appropriate pins of the LED segments in a particular order, some segments will brighten and others stay dim, thus showing the corresponding character on the display.
de: Jede der LEDs im Display erhält ein Positionssegment, wobei einer der Verbindungsstifte aus dem rechteckigen Kunststoffgehäuse herausgeführt wird. Diese LED-Pins sind von "a" bis "g" beschriftet und repräsentieren jede einzelne LED. Die anderen LED-Pins sind miteinander verbunden und bilden einen gemeinsamen Pin. Daher werden durch Vorwärtsvorspannung der entsprechenden Stifte der LCD-Segmente in einer bestimmten Reihenfolge einige Segmente heller, während andere Segmente abgeblendet bleiben, wodurch die entsprechenden Zeichen auf dem Display angezeigt werden.

source: Connect each of pin a-g of the 7-Segment Display to one 220ohm current limiting resistor respectively and then to pin 4–11. GND connects to GND.
de: Verbinden Sie jeden Pin ag des 7-Segment-Displays mit einem 220-Ohm-Strombegrenzungswiderstand und dann mit Pin 4–11. GND verbindet sich mit GND.

source: The wiring between the 7-segment display and the Mega2560 board as shown below :
de: Die Verkabelung zwischen dem 7-Segment-Display und der Mega2560-Karte wie unten gezeigt:

source: Schematic Diagram
de: Schematische Darstellung

source: Once upload the codes, you can see the 7-segment display displaying 1, 2, 3, 4, 5, 6, 7, 8, 9, A, b, C, d, E, F in sequence.
de: Sobald Sie die Codes hochgeladen haben, sehen Sie in der 7-Segment-Anzeige nacheinander 1, 2, 3, 4, 5, 6, 7, 8, 9, A, b, C, d, E, F nacheinander.

source: Code Analysis
de: Code-Analyse

source: Take the pin numbers on 7-segment as names, and declare the pins on the Mega2560 board.
de: Nehmen Sie die Pin-Nummern auf dem 7-Segment als Namen und deklarieren Sie die Pins auf der Mega2560-Platine.

source: Install a series of subfunctions to package the level state at each block during the number display of the 7-segment. For example, when the character 「2」 is displayed, the block F and the block c are turn off; the other blocks are lit up.
de: Installieren Sie eine Reihe von Unterfunktionen, um den Pegelstatus an jedem Block während der Nummernanzeige des 7-Segments zu verpacken. Wenn beispielsweise das Zeichen 「2 displayed angezeigt wird, werden der Block F und der Block c ausgeschaltet. Die anderen Blöcke leuchten.

source: First we need to know how it looks like when display the numeral **2** on the 7-Segment display. It's actually the segments a, b, d, e and g are power on, which generates the display of **2**. In programming, pins connected to these segments are set High level when c and f are Low level. Here we use a *for()* statement to set these pins as High level respectively (the braces after *for()* are deleted as there is only one line). Connect pin dp to pin 4; it's already defined as LOW in *setup()*.
de: Zuerst müssen wir wissen, wie es aussieht, wenn die Ziffer **2** auf der 7-Segment-Anzeige angezeigt wird. Es sind tatsächlich die Segmente a, b, d, e und g, die eingeschaltet sind, was die Anzeige von **2** erzeugt. Bei der Programmierung werden die mit diesen Segmenten verbundenen Pins auf High Level gesetzt, wenn c und f Low Level sind. Hier verwenden wir eine *for()* - Anweisung, um diese Pins jeweils als High Level festzulegen (die geschweiften Klammern nach *for()* werden gelöscht, da nur eine Zeile vorhanden ist). Verbinden Sie Pin dp mit Pin 4; Es ist bereits in *setup()* als LOW definiert.

source: After running this part, the 7-segment will display **2**. Similarly, the display of other characters are the same. Since the letters b and d in upper case, namely **B** and **D**, would look the same with **8** and **0** on the display, they are displayed in lower case instead.
de: Nach dem Ausführen dieses Teils zeigt das 7-Segment **2** an. Ebenso ist die Anzeige anderer Zeichen gleich. Da die Großbuchstaben b und d, dh **B** und **D**, auf dem Display wie **8** und **0** aussehen, werden sie in Kleinbuchstaben angezeigt.

source: In loop(), call the function that displays the number.
de: Rufen Sie in loop () die Funktion auf, die die Nummer anzeigt.

source: Phenomenon Picture
de: Phänomen Bild
