Repository: sunfounder/vincent-kit
Catalog: docs/source/locale/*/LC_MESSAGES/3.3_Overheat_Monitor.po
Languages: de

source: 3.3 Overheat Monitor
de: 3.3 Überhitzungsmonitor

source: **Overview**
de: **Überblick**

source: You may want to make an overheat monitoring device that applies to various situations. When the temperature of room is above 30°C in summer, the electric fan or the air conditioner will be turned on automatically. If the refrigerator stops to refrigerate, there will emit alarm. When the CPU gets overheated, the water-cooling system turns on. Next, we will use thermistor, relay, button, rotary encoder and LCD to make an intelligent temperature monitoring device whose threshold is adjustable. You can make it suitable for the scene you want by inserting different peripherals into the relay and using a rotary encoder to adjust the high temperature threshold.
de: Möglicherweise möchten Sie ein Überhitzungsüberwachungsgerät erstellen, das für verschiedene Situationen gilt. Wenn die Raumtemperatur im Sommer über 30 ° C liegt, wird der elektrische Ventilator oder die Klimaanlage automatisch eingeschaltet. Wenn der Kühlschrank zum Kühlen stehen bleibt, wird ein Alarm ausgegeben. Wenn die CPU überhitzt, wird das Wasserkühlsystem eingeschaltet. Als nächstes werden wir Thermistor, Relais, Taste, Als nächstes werden wir Thermistoren, Relais, Tasten, Drehgeber und LCDs verwenden, um intelligente Temperaturüberwachungsgeräte mit einstellbaren Schwellenwerten herzustellen. Durch Anschließen verschiedener Peripheriegeräte an das Relais und Verwenden eines Drehgebers zum Einstellen der Hochtemperaturschwelle kann diese an die gewünschte Szene angepasst werden.

source: **Components Required**
de: **Erforderliche Komponenten**

source: In this example, the component modules are connected as shown in the table.
de: In diesem Beispiel werden die Komponentenmodule wie in der Tabelle gezeigt verbunden.

source: **Schematic Diagram**
de: **Schematische Darstellung**

source: **Example Explanation**
de: **Beispiel Erklärung**

source: The flow diagram of the project is as follows:
de: Das Flussdiagramm des Projekts sieht wie folgt aus:

source: By using EEPROM.h library, the high temperature threshold is saved in EEPROM to avoid the value reset after the restart of MCU.
de: Bei Verwendung der Bibliothek EEPROM.h wird der Hochtemperaturschwellenwert im EEPROM gespeichert, um zu vermeiden, dass der Wert nach dem Neustart der MCU zurückgesetzt wird.

source: **Library Functions：**
de: **Bibliotheksfunktionen:**

source: Write a byte to the EEPROM.
de: Schreiben Sie ein Byte in das EEPROM.

source: Reads a byte from the EEPROM. Locations that have never been written to have the value of 255.
de: Liest ein Byte aus dem EEPROM. Standorte, die noch nie geschrieben wurden, haben den Wert 255.

source: Write a byte to the EEPROM. The value is written only if differs from the one already saved at the same address.
de: Schreiben Sie ein Byte in das EEPROM. Der Wert wird nur geschrieben, wenn er von dem Wert abweicht, der bereits unter derselben Adresse gespeichert wurde.

source: Write any data type or object to the EEPROM.
de: Schreiben Sie einen beliebigen Datentyp oder ein beliebiges Objekt in das EEPROM.

source: Read any data type or object from the EEPROM.
de: Lesen Sie einen beliebigen Datentyp oder ein beliebiges Objekt aus dem EEPROM.

source: **Phenomenon Picture**
de: **Phänomen Bild**
