Repository: sunfounder/vincent-kit
Catalog: docs/source/locale/*/LC_MESSAGES/3.4_Guess_Number.po
Languages: de

source: 3.4 Guess Number
de: 3.4 Vermutungsnummer

source: **Overview**
de: **Überblick**

source: Guessing Numbers is a fun party game where you and your friends take turns inputting a number (0~99). The range will be smaller with the inputting of the number till a player answers the riddle correctly. Then the player is defeated and punished. For example, if the lucky number is 51 which the players cannot see, and the player ① inputs 50, the prompt of number range changes to 50~99; if the player ② inputs 70, the range of number can be 50~70; if the player ③ inputs 51, he or she is the unlucky one. Here, we use IR Remote Controller to input numbers and use LCD to output outcomes.
de: Guessing Numbers ist ein lustiges Partyspiel, bei dem Sie und Ihre Freunde abwechselnd eine Zahl eingeben (0 ~ 99). Nach Eingabe der Nummer wird der Bereich kleiner, bis der Spieler das Rätsel richtig beantwortet. Dann wird der Spieler besiegt und bestraft. Wenn zum Beispiel die Glückszahl 51 ist, die die Spieler nicht sehen können, und der Spieler 50 50 eingibt, ändert sich die Eingabeaufforderung des Nummernbereichs auf 50 ~ 99; Wenn der Spieler ② 70 eingibt, kann der Zahlenbereich zwischen 50 und 70 liegen. Wenn der Spieler ③ 51 eingibt, ist er oder sie der Unglückliche. Hier verwenden wir die IR-Fernbedienung zur Eingabe von Zahlen und das LCD zur Ausgabe von Ergebnissen.

source: **Components Required**
de: **Erforderliche Komponenten**

source: In this example, the wiring of LCD1602 and infrared receiving module is as follows.
de: In diesem Beispiel ist die Verkabelung von LCD1602 und Infrarot-Empfangsmodul wie folgt.

source: **Schematic Diagram**
de: **Schematische Darstellung**

source: **Example Explanation**
de: **Beispiel Erklärung**

source: In order to make the number guessing game become vivid and funny, we need to achieve the following functions:
de: Um das Zahlenschätzspiel lebendig und interessant zu gestalten, müssen wir die folgenden Funktionen implementieren:

source: The lucky number will be displayed when we start and reset the game, and the number range prompt is reset to 0 ~ 99.
de: Die Glückszahl wird angezeigt, wenn wir das Spiel starten und zurücksetzen, und die Eingabeaufforderung für den Nummernbereich wird auf 0 bis 99 zurückgesetzt.

source: LCD will display the number being input and the number range prompt.
de: Das LCD zeigt die eingegebene Nummer und die Eingabeaufforderung für den Nummernkreis an.

source: After inputting two digits, there appears result judgment automatically.
de: Nach Eingabe von zwei Ziffern erscheint automatisch eine Ergebnisbeurteilung.

source: If you input a single digit, you can press the CYCLE key (the key at the center of the Controller) to start the result judgment.
de: Wenn Sie eine einzelne Ziffer eingeben, können Sie die Taste CYCLE (die Taste in der Mitte des Controllers) drücken, um die Ergebnisbeurteilung zu starten.

source: If the answer is not guessed, the new number range prompt will be displayed (if the lucky number is 51 and you enter 50, the number range prompt will change to 50~99).
de: Wenn die Antwort nicht erraten wird, wird eine neue Eingabeaufforderung für den Nummernkreis angezeigt (wenn die Glückszahl 51 ist und Sie 50 eingeben, wird die Eingabeaufforderung für den Nummernbereich auf 50 bis 99 geändert).

source: The game is automatically reset after the lucky number is guessed, so that the player can play a new round.
de: Das Spiel wird automatisch zurückgesetzt, nachdem die Glückszahl erraten wurde, sodass der Spieler eine neue Runde spielen kann.

source: The game can be reset by directly pressing the POWER button (the button in the upper left corner).
de: Das Spiel kann durch direktes Drücken der POWER-Taste (der Taste in der oberen linken Ecke) zurückgesetzt werden.

source: In conclusion, the work flow of the project is shown in the flow chart.
de: Abschließend wird der Arbeitsablauf des Projekts im Flussdiagramm angezeigt.

source: **Phenomenon Picture**
de: **Phänomen Bild**
